ALCH_REZ = "960x495"

#ENCHANT_COORDS_OLD = {
#    "slot_1": ["383, 247", "407, 268"],
#    "slot_2": ["433, 247", "457, 268"],
#    "slot_3": ["483, 247", "507, 268"],
#    "slot_4": ["533, 247", "557, 268"],
#    "slot_5": ["583, 247", "607, 268"]
#}

#ALCH_SLOTS_FULL_OLD = {
#    "slot_1": ["358, 220", "407, 268"],
#    "slot_2": ["408, 220", "457, 268"],
#    "slot_3": ["458, 220", "507, 268"],
#    "slot_4": ["508, 220", "557, 268"],
#    "slot_5": ["558, 220", "607, 268"]
#}

ENCHANT_COORDS = {
    "slot_1": ["387, 232", "405, 253"],
    "slot_2": ["437, 232", "455, 253"],
    "slot_3": ["487, 232", "505, 253"],
    "slot_4": ["537, 232", "555, 253"],
    "slot_5": ["587, 232", "605, 253"]
}

ALCH_SLOTS_FULL = {
    "slot_1": ["356, 202", "402, 247"],
    "slot_2": ["407, 202", "452, 247"],
    "slot_3": ["457, 202", "502, 247"],
    "slot_4": ["507, 202", "552, 247"],
    "slot_5": ["558, 202", "602, 247"]
}

ALCH_BUTTONS = {
    "alch_zero_reroll": ["344, 447", "157, 153, 143"], # когда алхимка не заряжена серая кнопка
    "alch_not_zero_start": ["342, 447", "246, 245, 242"], # когда алхимка заряжена но не было предсказаний
    "alch_first_reroll": ["501, 319", "255, 255, 255"], # подтверждение первого ролла
    "reroll": ["272, 448", "119, 104, 65"],
    "reroll_confirm": ["515, 351", "208, 94, 9"],
    "reroll_cancel": ["381, 341", "255, 255, 255"],
    "gold": ["452, 264", "255, 210, 90"], #wsize ставить 7x7, thr ставить 15
    "white": ["484, 255", "255, 255, 255"], #wsize ставить 7x7, thr ставить 15
    "blue": ["435, 262", "90, 150, 177"], #wsize ставить 3x3, thr ставить 10
}


#todo
MINI_ALCH_BUTTONS = {
    ...
}
MINI_ALCH_POSITIONS = {
    ...
}