ALCH_REZ = "960x495"

ALCH_POSITIONS_ENCHANT = {
    #это гавно которое после нажатия на "Повторить прогноз" 5 слотов в ряд удобно без шумов
    "slot_1": ["376, 227", "408, 259"],
    "slot_2": ["426, 227", "458, 259"],
    "slot_3": ["478, 227", "510, 259"],
    "slot_4": ["527, 227", "559, 259"],
    "slot_5": ["579, 227", "611, 259"]
}
ALCH_SLOTS_FULL = {
    "slot_1": ["355, 204", "402, 249"],
    "slot_2": ["407, 203", "451, 248"],
    "slot_3": ["459, 204", "505, 249"],
    "slot_4": ["508, 204", "553, 248"],
    "slot_5": ["558, 205", "601, 249"]
}
ALCH_BUTTONS = {
    "alch_zero_reroll": ["344, 447", "157, 153, 143"], # когда алхимка не заряжена серая кнопка
    "alch_not_zero_start": ["342, 447", "246, 245, 242"], # когда алхимка заряжена но не было предсказаний
    "alch_first_reroll": ["505, 311", "255, 255, 255"], # подтверждение первого ролла
    "reroll": ["272, 448", "119, 104, 65"],
    "reroll_confirm": ["515, 351", "215, 103, 11"],
    "reroll_cancel": ["382, 360", "239, 239, 240"],
    "gold": ["452, 264", "255, 210, 90"], #wsize ставить 7x7, thr ставить 15
    "white": ["484, 255", "255, 255, 255"], #wsize ставить 7x7, thr ставить 15
    "blue": ["435, 262", "90, 150, 177"], #wsize ставить 3x3, thr ставить 10
}


#todo
MINI_ALCH_BUTTONS = {
    ...
}
MINI_ALCH_POSITIONS = {
    ...
}