LOG_DIR = r"logs"
PROFILES_DIR = r"profiles"
SETTINGS_DIR = r"settings"

# методом getNPCposition - получим список доступных нпс и их позиции
NPCS = [
    "stash", "shop", "buyer"
]

# кнопки в интерфейсе каждого нпс, по ним проверяем что дошли
NPC_CHECK_BUTTONS = {
    "stash": "npc_stash_button_1",
    "shop": "npc_shop_button_1",
    "buyer": "npc_buyer_button_1",
}

#todo ру сервак допилить но то не скоро
CBT_RU = {}

CBT_JP = {
    "schedule_menu": ["316, 124", "no"],
    "schedule_start": ["299, 199", "215, 102, 11"],
    "schedule_stop": ["303, 199", "113, 98, 61"],

    "magaz_monetka_reklama": ["214, 12", "24, 15, 7"],
    "magaz_circle_close": ["16, 183", "no"], # кругляш который закрывает баннер на веки
    "magaz_reklama_close": ["12, 185", "no"],
    "magaz_google_close": ["379, 16", "61, 63, 61"],
    "magaz_reklama_trigger": ["101, 196", "46, 46, 46"], # реклама в магазе, если ее видим то жмем по magaz_reklama_close
    "magaz_google_trigger": ["281, 122", "255, 255, 255"], # вторая реклама, закрывается magaz_google_close
    "magaz_gui_open": ["302, 12", "no"], # магазин донат
    "red_dot_magaz": ["173, 27", "193, 23, 17"], # красная точка в магазе внутри магаз интерфейса
    "3_vkladka": ["147, 35", "34, 45, 62"],
    "magaz_str_1": ["339, 53", "no"], #страница 1
    "magaz_str_2": ["356, 77", "no"], #страница 2
    "magaz_str_3": ["353, 97", "no"], #страница 3
    "magaz_str_4": ["352, 116", "no"], #страница 4
    "purc_all_magaz": ["338, 210", "216, 105, 12"], # оранж кнопка, открывает выбор шмоток на закуп
    "buy_all_magaz": ["248, 191", "207, 90, 8"], # когда шмотки выбраны жмем купить
    "close_buy_magaz": ["159, 192", "181, 184, 189"], # закрытие магаза когда вкладка открыта и выбраны шмотки
    "close_magaz": ["382, 11", "168, 169, 171"], # вроде правый верхнийц угол выход
    "confirm_orange_center": ["227, 151", "225, 125, 11"], # оранж кнопка конфирм
    
    "lvl_up_close": ["100, 29", "no"], # закрытие окна лвл апа
    "lvl_up_black": ["60, 87", "2, 2, 2"], # черный фон в окне лвл апа, если он есть можно кликнуть по lvl_up_close
    "white_cube_in_minimap": ["12, 62", "199, 199, 199"], # кубик который находится в миникарте, по нему можно понять открыт ли нпс лист, а в дальнейшем понять находимся ли мы в городе
    "monetka_gui": ["213, 11", "219, 174, 93"], # иконка монетки в гуи
    "diamond_gui": ["186, 9", "166, 172, 218"], # иконка алмаза в гуи
    "zalupka_gui": ["79, 26", "253, 253, 253"], # залупка тест
    "you_were_killed_energomode": ["192, 157", "117, 21, 38"], # плашка о смерти в режиме энергосбереж "YOU ARE KILLED"
    "check_death_penalty": ["233, 188", "196, 198, 202"], # кнопка респавна после смерти от игрока
    "respawn_village": ["167, 183", "186, 188, 193"], # вторая кнопка респавна после смерти от хай лвл моба
    "energo_mode_gui": ["13, 132", "no"], # кнопка для включения энерго режима, дальше нужно кликнуть в центр
    "auto_combat_mode_gui": ["323, 112", "no"], # кнопка для включения/выключения автоохоты
    "auto_combat_ON": ["183, 161", "14, 8, 6"], # исчезающая надпись оранжевая Huntng...
    "monetka_energomode_gui": ["15, 53", "216, 193, 146"], # монетка слева экрана
    "viewmode_change_btn": ["51, 211", "175, 176, 177"], # можно юзать вместо алмазика при проверках тп
    "pvp_energo_trigger": ["367, 145", "220, 220, 220"], # тригер пвп в энергорежиме, при виде него тпаем окно

    "energomode_center_gui": ["203, 103", "220, 220, 220"], # 2 белые полоски по центру энергомода по ним + по оффлайн фарму детектим находимся ли мы в энергомоде
    "offline_play_energomode_gui": ["316, 199", "182, 82, 9"], # белая буква кнопки оффлайн плея в энергорежиме

    "lvl_up_trigger": ["95, 172", "184, 13, 10"], # когда апнул лвл в энерго режиме вылазит окно, это тригер на его существование
    "need_lvl_up": ["10, 204", "184, 13, 10"], # это красная точка над лвлом, если есть то можем качнуть левл
    "lvl_up_activate1": ["17, 210", "no"], # если значение выше (need_lvl_up) тру то можно кликнуть сюда чтоб открыть меню лвл апа

    "npc_list_in_town": ["79, 52", "no"], # в городе кнопка которая открывает список нпс для авто-бега к ним
    "npc_list_1": ["17, 30", "no"], # 1
    "npc_list_2": ["17, 45", "200, 142, 105"], # 2 (тут возмозжен сундук)
    "npc_list_3": ["18, 61", "241, 220, 208"], # 3 (тут возмозжен сундук)
    "npc_list_4": ["17, 75", "250, 244, 239"], # 4 (тут возможен сундук)
    "npc_list_5": ["19, 90", "250, 241, 236"], # 5 (тут возможен сундук)
    "npc_list_6": ["17, 104", "no"], # 6

    "npc_global_quit_button": ["377, 10", "no"], # общая кнопка для всех нпс чтоб выйти из диалога
    "npc_stash_button_1": ["334, 204", "228, 229, 231"], # кнопка у складовщика Auto-Stash, по ней мы чекаем что добежали к складу
    "npc_stash_button_2": ["376, 204", "252, 245, 239"], # кнопка у складовщика Deposit All, по ней мы чекаем что складываем не пустоту
    "npc_shop_button_1": ["330, 206", "98, 104, 113"], # кнопка у торговца, по ней мы чекаем что дошли к нему
    "npc_shop_button_2": ["364, 205", "249, 235, 225"], # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    "npc_shop_button_3": ["253, 152", "207, 91, 8"], # кнопка у торговца, подтверждаем покупку
    "npc_buyer_button_1": ["297, 204", "241, 242, 243"], # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    "npc_buyer_button_2": ["364, 205", "249, 235, 225"], # кнопка у скупщика, такая же как npc_shop_button_2"
    "npc_buyer_button_3": ["253, 152", "207, 91, 8"], # кнопка у скупщика, такая же как npc_shop_button_3

    "respawn_select_all": ["115, 131", "123, 126, 130"],
    "delete_exp": ["33, 160", "36, 43, 50"],
    "delete_all_yes": ["223, 152", "248, 231, 219"],
    "respawn_exp": ["29, 32", "no"],
    "respawn_items": ["76, 36", "no"],
    "respawn_exit_gui_button": ["120, 28", "no"], # кнопка выхода из гуи
    "respawn_icon_in_gui": ["95, 175", "255, 255, 255"], # рандом залупа в окне выкупа предметов, по ней детектим открытое окно
    "monetka_respawn": ["103, 131", "182, 127, 38"], # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    "krest_after_respawn": ["263, 13", "no"], # после респавна можно нажать на крест и выкупить свои шмотки
    "respawn_monetka_exp_1": ["37, 55", "255, 233, 168"],
    "respawn_monetka_exp_2": ["37, 76", "255, 233, 168"],
    "respawn_monetka_exp_3": ["37, 96", "244, 203, 126"],
    "respawn_monetka_exp_4": ["37, 118", "254, 230, 175"],
    "respawn_buy_gui_button": ["60, 156", "143, 147, 151"], # кнопка после выбора того что выкупать, подтверждаем
    "respawn_accept_buy_gui_button": ["222, 148", "244, 214, 188"], # кнопка подтверждения покупки выкупа

    "home_scroll_button_energomode": ["373, 177", "144, 120, 101"], # свиток телепорта в энергомоде
    "home_scroll_button_no_energomode": ["376, 197", "188, 168, 144"], # свиток телепорта в обычном интерфейсе

    "spot_teleport_call_button": ["76, 29", "no"], # кнопка вызова списка для телепорта на спот
    "spot_choice_1": ["72, 72", "no"], # кнопка выбора первого спота
    "spot_choice_2": ["72, 89", "no"], # кнопка выбора второго спота
    "spot_choice_3": ["72, 105", "no"], # кнопка выбора третьего спота
    "spot_choice_4": ["72, 121", "no"], # кнопка выбора четвертого спота

    "spot_acept_choice_1": ["94, 85", "255, 255, 255"], # кнопка телепорта на первый спот
    "spot_acept_choice_2": ["94, 101", "255, 255, 255"], # кнопка телепорта на второй спот
    "spot_acept_choice_3": ["94, 117", "255, 255, 255"], # кнопка телепорта на третий спот
    "spot_acept_choice_4": ["94, 139", "255, 255, 255"], # кнопка телепорта на четвертый спот

    "hp_bank_in_energo": ["178, 196", "84, 84, 84"], # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    "kolvo_banok_energo": ["185, 207", "117, 117, 117"], # антистан, так точно поймем когда банок 0
    "pereves1": ["242, 194", "199, 40, 40"], # красный перевес 80%
    "pereves2": ["242, 194", "188, 90, 5"], # оражневый перевес 60%

    "cancel_button_vitality": ["215, 145", "215, 102, 11"],  # когда вылезла табличка шо уже лимит

    "main_menu_gui": ["385, 6", "no"], # кнопка в правом верхнем углу открывает меню
    "red_dot_clan": ["366, 60", "184, 13, 10"], # красная точка около клана
    "clan_1": ["61, 26", "185, 13, 10"], # по этой залупе чекаем что прогрузилось, это красная точка около текста Clan
    "clan_2": ["204, 205", "189, 184, 171"], # кнопка донат
    "clan_3": ["101, 173", "176, 124, 40"], # после доната выбор адены
    "clan_4": ["222, 152", "243, 213, 192"], # кнопка подтверждения доната
    "clan_5": ["349, 31", "36, 40, 47"], # кнопка закрытия вкладки с выбором доната
    "clan_6": ["131, 157", "193, 23, 17"], # после всех донатов и закрытия красная точка около получения наград, для выхода можно юзать цбт npc_global_quit_button

    "red_dot_achiv": ["367, 5", "193, 23, 17"], # красная точка около ачивок
    "red_dot_achiv2": ["260, 27", "46, 32, 42"], # вторая крсаня точка уже в меню ачивок
    "achiv_claim_1": ["385, 51", "184, 13, 10"], # первая ачивка на клайм, можно дрюкать ее бесконечно пока не соберем все
    "achiv_claim_accept": ["178, 164", "235, 187, 152"], # подтверждение сбора ачивки

    "red_dot_mail": ["70, 27", "193, 23, 17"], # красная точка на почте в окне почты
    "red_dot_mail_menu": ["307, 148", "184, 13, 10"], # красная точка на почте в меню
    "claim_all_mail": ["346, 205", "222, 144, 89"], # собрать всю почту
    "clear_mail": ["198, 117", "30, 35, 42"], # когда писем нет
    "red_dot_mail_clear": ["70, 27", "193, 23, 17"],

    "red_dot_daily_rewards": ["326, 87", "182, 4, 5"], # красная точка на дейлике
    "red_dot_daily_2": ["395, 34", "182, 4, 5"], # красная точка когда уже открыл меню дейликов 1 вкладка
    "daily_rewards_claim_1": ["298, 119", "248, 231, 219"], # сбор дейлика верхний
    "daily_rewards_claim_2": ["300, 202", "216, 106, 12"],  # сбор дейлика нижний
    "monetka_proverka": ["246, 114", "176, 119, 33"],
    "confirm_buy_daily": ["234, 151", "206, 89, 8"],

    "battle_pass_red_dot_gui": ["326, 147", "182, 4, 5"], # красная точка в меню что батл пасс надо собирать
    "battle_pass_sbor_1": ["286, 61", "193, 24, 17"], # сбор одной награды через Claim
    "battle_pass_sbor_2": ["386, 203", "185, 13, 10"], # сбор всех наград через клейм ревард большую кнопку
    "battle_pass_sbor_2_2": ["342, 203", "185, 13, 10"], # сбор всех наград через клейм ревард маленькую кнопку
    "battle_pass_empty": ["270, 24", "no"], # пустота сверху, чтоб не перекрывать цвет мышью
}

BATTLE_PASS = {
    "red_dot_clr_podvkladka": ["140, 17, 13"], # красная точка на подвкладке
    "red_dot_clr_vkladka": ["193, 23, 17"], # красные точки по всей ширине основных вкладок сверху
    "y_vkladki": 27, # высота от левого верхного края окна игры, на этой высоте ищем от 1 координаты до 425 красные точки чтоб поняыть сколько вкладок бп актуально
    "x_podvkladki": 15 # ширина окна, по вертикали бегаем ищем подвкладки
}

DAILY = {
    "red_dot_clr": ["182, 4, 5"], # красная точка на вкладке
    "y_vkladki": 395,  # ширина окна

    "almaz_donate": ["156, 174, 198"], # внутри вкладки дейлика алмазик в кнопке
    "monetka_donate": ["247, 200, 112"], # внутри вкладки дейлика монетка в кнопке
    "monetka_proverka": ["246, 114", "176, 119, 33"],
    "confirm_buy_daily": ["234, 151", "206, 89, 8"],

    "claim_daily": ["207, 90, 8"],

    "start_button_1": 109,
    "end_button_1": 125,
    "start_button_2": 197,
    "end_button_2": 212
}

GLOBAL_STATES = [
    "null",
    "afk",
    "combat",
    "shopping",
    "stashing",
    "death",
    "claiming",
    "schedule"
]

SUPPORTED_REZ = [
    "400x225"
]