CBT_BASE = {
    'inventory_slot1_empty_1': ["305, 62", "42, 44, 47"],
    'inventory_slot1_empty_2': ["305, 57", "41, 42, 46"],
    'inventory_slot1_empty_3': ["304, 54", "42, 45, 48"],
    'inventory_slot1_empty_4': ["304, 49", "41, 42, 46"],
    'party_dungeon_hard_1': ["266, 45", "no"],
    'party_dungeon_hard_2': ["266, 65", "no"],
    'party_dungeon_hard_3': ["266, 85", "no"],
    'party_dungeon_hard_4': ["266, 105", "no"],
    'party_dungeon_join': ["367, 205", "206, 89, 8"],  # Заявка на вход
    'party_dungeon_join2': ["211, 146", "215, 104, 11"],  # Заявка на вход после выбора сложности
    'party_dungeon_join3': ["213, 196", "207, 91, 8"],  # после клика на портал
    'dungeon_button_menu': ["322, 97", "no"],  # подземелья в меню
    'party_create': ["205, 190", "215, 103, 11"],
    'party_close': ["264, 30", "151, 154, 157"],
    'party_settings_me': ["262, 121", "15, 18, 22"],
    'party_settings_me2': ["262, 121", "no"],
    'schedule_cant_start': ["372, 200", "107, 52, 5"],
    'schedule_start': ["299, 199", "215, 102, 11"],
    'schedule_stop': ["303, 199", "113, 98, 61"],
    'magaz_monetka_reklama': ["214, 12", "24, 15, 7"],
    'magaz_circle_close': ["16, 183", "no"],  # кругляш который закрывает баннер на веки
    'magaz_reklama_close': ["12, 185", "no"],
    'magaz_google_close': ["379, 16", "61, 63, 61"],
    'magaz_reklama_trigger': ["101, 196", "46, 46, 46"],  # реклама в магазе, если ее видим то жмем по magaz_reklama_close
    'magaz_google_trigger': ["281, 122", "255, 255, 255"],  # вторая реклама, закрывается magaz_google_close
    'magaz_gui_open': ["302, 12", "no"],  # магазин донат
    'red_dot_magaz': ["173, 27", "193, 23, 17"],  # красная точка в магазе внутри магаз интерфейса
    'magaz_str_1': ["339, 53", "no"],  #страница 1
    'magaz_str_2': ["356, 77", "no"],  #страница 2
    'magaz_str_3': ["353, 97", "no"],  #страница 3
    'magaz_str_4': ["352, 116", "no"],  #страница 4
    'purc_all_magaz': ["338, 210", "216, 105, 12"],  # оранж кнопка, открывает выбор шмоток на закуп
    'close_magaz': ["382, 11", "168, 169, 171"],  # вроде правый верхнийц угол выход
    'confirm_orange_center': ["227, 151", "225, 125, 11"],  # оранж кнопка конфирм
    'lvl_up_close': ["100, 29", "no"],  # закрытие окна лвл апа
    'lvl_up_black': ["91, 174", "255, 255, 255"],  # белая стрелка окна с лвлапом, юзаем как триггер 1
    'lvl_up_black_2': ["56, 176", "247, 248, 248"],  # вторая хуйня слева от стрелки тоже белая, как триггер 2
    'white_cube_in_minimap': ["12, 62", "199, 199, 199"],  # кубик который находится в миникарте, по нему можно понять открыт ли нпс лист, а в дальнейшем понять находимся ли мы в городе
    'monetka_gui': ["213, 11", "219, 174, 93"],  # иконка монетки в гуи
    'diamond_gui': ["186, 9", "166, 172, 218"],  # иконка алмаза в гуи
    'energo_mode_gui': ["13, 132", "no"],  # кнопка для включения энерго режима, дальше нужно кликнуть в центр
    'auto_combat_mode_gui': ["323, 112", "no"],  # кнопка для включения/выключения автоохоты
    'monetka_energomode_gui': ["15, 53", "216, 193, 146"],  # монетка слева экрана
    'viewmode_change_btn': ["51, 211", "175, 176, 177"],  # можно юзать вместо алмазика при проверках тп
    'pvp_energo_trigger': ["367, 145", "220, 220, 220"],  # тригер пвп в энергорежиме, при виде него тпаем окно
    'energomode_center_gui': ["203, 103", "220, 220, 220"],  # 2 белые полоски по центру энергомода по ним + по оффлайн фарму детектим находимся ли мы в энергомоде
    'offline_play_energomode_gui': ["316, 199", "182, 82, 9"],  # белая буква кнопки оффлайн плея в энергорежиме
    'lvl_up_trigger': ["95, 172", "184, 13, 10"],  # когда апнул лвл в энерго режиме вылазит окно, это тригер на его существование
    'need_lvl_up': ["10, 204", "184, 13, 10"],  # это красная точка над лвлом, если есть то можем качнуть левл
    'lvl_up_activate1': ["17, 210", "no"],  # если значение выше (need_lvl_up) тру то можно кликнуть сюда чтоб открыть меню лвл апа
    'npc_list_in_town': ["79, 52", "no"],  # в городе кнопка которая открывает список нпс для авто-бега к ним
    'npc_list_1': ["17, 30", "no"],  # 1
    'npc_list_2': ["17, 45", "200, 142, 105"],  # 2 (тут возмозжен сундук)
    'npc_list_3': ["18, 61", "241, 220, 208"],  # 3 (тут возмозжен сундук)
    'npc_list_4': ["17, 75", "250, 244, 239"],  # 4 (тут возможен сундук)
    'npc_list_5': ["19, 90", "250, 241, 236"],  # 5 (тут возможен сундук)
    'npc_global_quit_button': ["377, 10", "no"],  # общая кнопка для всех нпс чтоб выйти из диалога
    'npc_shop_button_3': ["253, 152", "207, 91, 8"],  # кнопка у торговца, подтверждаем покупку
    'npc_shop_button_no_adena': ["243, 117", "214, 170, 100"],  # после того как выбрали предметы и нажали на покупку может дать окно о том, что адены нет
    'respawn_select_all': ["115, 131", "123, 126, 130"],
    'delete_exp': ["33, 160", "36, 43, 50"],
    'delete_all_yes': ["223, 152", "248, 231, 219"],
    'respawn_exp': ["29, 32", "no"],
    'respawn_items': ["76, 36", "no"],
    'respawn_exit_gui_button': ["120, 28", "no"],  # кнопка выхода из гуи
    'respawn_icon_in_gui': ["95, 175", "255, 255, 255"],  # рандом залупа в окне выкупа предметов, по ней детектим открытое окно
    'krest_after_respawn': ["264, 9", "237, 209, 127"],  # после респавна можно нажать на крест и выкупить свои шмотки
    'respawn_monetka_exp_1': ["37, 55", "255, 233, 168"],
    'respawn_monetka_exp_2': ["37, 76", "255, 233, 168"],
    'respawn_monetka_exp_3': ["37, 96", "244, 203, 126"],
    'respawn_monetka_exp_4': ["37, 118", "254, 230, 175"],
    'home_scroll_button_energomode': ["373, 177", "144, 120, 101"],  # свиток телепорта в энергомоде
    'home_scroll_button_no_energomode': ["376, 197", "188, 168, 144"],  # свиток телепорта в обычном интерфейсе
    'spot_teleport_call_button': ["76, 29", "no"],  # кнопка вызова списка для телепорта на спот
    'spot_choice_1': ["72, 72", "no"],  # кнопка выбора первого спота
    'spot_choice_2': ["72, 89", "no"],  # кнопка выбора второго спота
    'spot_choice_3': ["72, 105", "no"],  # кнопка выбора третьего спота
    'spot_choice_4': ["72, 121", "no"],  # кнопка выбора четвертого спота
    'spot_accept_choice_1': ["94, 85", "255, 255, 255"],  # кнопка телепорта на первый спот
    'spot_accept_choice_2': ["94, 101", "255, 255, 255"],  # кнопка телепорта на второй спот
    'spot_accept_choice_3': ["94, 117", "255, 255, 255"],  # кнопка телепорта на третий спот
    'spot_accept_choice_4': ["94, 139", "255, 255, 255"],  # кнопка телепорта на четвертый спот
    'main_menu_gui': ["385, 6", "no"],  # кнопка в правом верхнем углу открывает меню
    'clan_1': ["61, 26", "185, 13, 10"],  # по этой залупе чекаем что прогрузилось, это красная точка около текста Clan
    'clan_5': ["353, 29", "151, 153, 156"],  # кнопка закрытия вкладки с выбором доната
    'clan_6': ["131, 156", "184, 13, 10"],  # после всех донатов и закрытия красная точка около получения наград, для выхода можно юзать цбт npc_global_quit_button
    'red_dot_achiv': ["367, 5", "193, 23, 17"],  # красная точка около ачивок
    'red_dot_achiv2': ["260, 27", "46, 32, 42"],  # вторая крсаня точка уже в меню ачивок
    'achiv_claim_1': ["385, 51", "184, 13, 10"],  # первая ачивка на клайм, можно дрюкать ее бесконечно пока не соберем все
    'red_dot_mail': ["70, 27", "193, 23, 17"],  # красная точка на почте в окне почты
    'clear_mail': ["198, 117", "30, 35, 42"],  # когда писем нет
    'red_dot_mail_clear': ["70, 27", "193, 23, 17"],
    'red_dot_daily_rewards': ["307, 114", "182, 4, 5"],  # красная точка на дейлике
    'red_dot_daily_2': ["395, 34", "182, 4, 5"],  # красная точка когда уже открыл меню дейликов 1 вкладка
    'daily_rewards_claim_2': ["300, 202", "216, 106, 12"],  # сбор дейлика нижний #todo
    'monetka_proverka': ["246, 114", "176, 119, 33"],
    'confirm_buy_daily': ["234, 151", "206, 89, 8"],
    'battle_pass_red_dot_gui': ["326, 170", "182, 4, 5"],  # красная точка в меню что батл пасс надо собирать
    'battle_pass_sbor_1': ["286, 61", "193, 24, 17"],  # сбор одной награды через Claim
    'battle_pass_sbor_2': ["386, 203", "185, 13, 10"],  # сбор всех наград через клейм ревард большую кнопку
    'battle_pass_sbor_2_2': ["342, 203", "185, 13, 10"],  # сбор всех наград через клейм ревард маленькую кнопку
    'battle_pass_empty': ["270, 24", "no"],  # пустота сверху, чтоб не перекрывать цвет мышью
    'auction_server_market_server': ["342, 16", "no"],  # наш сервер
    'auction_server_market_global': ["296, 14", "no"],  # глобал аук
    'auction_sold_red_dot': ["171, 26", "184, 14, 11"],  # вкладка продано, там можно собрать алмазы
    'auction_sold_claim': ["338, 203", "76, 83, 97"],  # сбор алмазов со вкладки продано
    'auction_sell_select_all_inactive': ["252, 204", "45, 49, 56"],  # во вкладке продажа выбор всего (перевыставление) когда оно неактивно
    'trash_god_statue_trigger_1': ["88, 202", "185, 130, 43"],  # если кликнули по неверному нпс то это статуя
    'trash_god_statue_trigger_2': ["282, 34", "149, 157, 176"],
    'trash_god_statue_trigger_3': ["22, 40", "255, 255, 255"],
    'trash_god_statue_trigger_4': ["230, 46", "103, 115, 128"],
    'error_disconnect_to_menu': ["192, 46", "234, 145, 94"],  # куда кликнуть для входа на серв | +
    'error_disconnect_to_menu_trigger1': ["192, 46", "234, 145, 94"],  # | +
    'error_disconnect_to_menu_trigger2': ["208, 127", "207, 145, 93"],  # | +
    'error_disconnect_to_menu_trigger3': ["191, 106", "244, 239, 173"],  # | +
    'error_disconnect_to_menu_trigger4': ["143, 83", "252, 248, 224"],  # | +
    'error_disconnect_to_menu_with_err': ["190, 150", "217, 109, 12"],  # куда кликнуть шоб закрыть табличку | +
    'enter_to_server': ["315, 199", "216, 105, 11"],  # выбор персов, просто кнопка Enter
    'error_disconnect_full': ["188, 151", "223, 148, 95"],  # куда кликнуть шоб закрыть окно после 10 мин афк
    'error_disconnect_full_trigger1': ["270, 103", "92, 94, 97"],
    'error_disconnect_full_trigger2': ["133, 100", "54, 56, 60"],
    'error_disconnect_full_trigger3': ["190, 101", "83, 85, 88"],
    'error_disconnect_full_trigger4': ["193, 103", "180, 180, 181"],
    'error_ethernet_1': ["202, 151", "224, 152, 101"],  # (P:3102:500)
    'error_ethernet_1_trigger1': ["166, 95", "59, 62, 65"],
    'error_ethernet_1_trigger2': ["221, 95", "117, 118, 120"],
    'error_ethernet_1_trigger3': ["135, 103", "114, 116, 118"],
    'error_ethernet_1_trigger4': ["265, 107", "104, 106, 109"],
}
