CBT = {
    'inventory_slot1_empty_1': ["305, 62", "42, 44, 47"],
    'inventory_slot1_empty_2': ["305, 57", "41, 42, 46"],
    'inventory_slot1_empty_3': ["304, 54", "42, 45, 48"],
    'inventory_slot1_empty_4': ["304, 49", "41, 42, 46"],
    'party_dungeon_hard_1': ["266, 45", "no"],
    'party_dungeon_hard_2': ["266, 65", "no"],
    'party_dungeon_hard_3': ["266, 85", "no"],
    'party_dungeon_hard_4': ["266, 105", "no"],
    'party_dungeon_join': ["367, 205", "206, 89, 8"],  # Заявка на вход
    'party_dungeon_join2': ["211, 146", "215, 104, 11"],  # Заявка на вход после выбора сложности
    'party_dungeon_join3': ["213, 196", "207, 91, 8"],  # после клика на портал
    'dungeon_button_menu': ["322, 97", "no"],  # подземелья в меню
    'schedule_cant_start': ["372, 200", "107, 52, 5"],
    'schedule_start': ["299, 199", "215, 102, 11"],
    'schedule_stop': ["303, 199", "113, 98, 61"],
    'magaz_monetka_reklama': ["214, 12", "24, 15, 7"],
    'magaz_circle_close': ["16, 183", "no"],  # кругляш который закрывает баннер на веки
    'magaz_reklama_close': ["12, 185", "no"],
    'magaz_google_close': ["379, 16", "61, 63, 61"],
    'magaz_reklama_trigger': ["101, 196", "46, 46, 46"],  # реклама в магазе, если ее видим то жмем по magaz_reklama_close
    'magaz_google_trigger': ["281, 122", "255, 255, 255"],  # вторая реклама, закрывается magaz_google_close
    'magaz_gui_open': ["302, 12", "no"],  # магазин донат
    'red_dot_magaz': ["173, 27", "193, 23, 17"],  # красная точка в магазе внутри магаз интерфейса
    'magaz_str_1': ["339, 53", "no"],  #страница 1
    'magaz_str_2': ["356, 77", "no"],  #страница 2
    'magaz_str_3': ["353, 97", "no"],  #страница 3
    'magaz_str_4': ["352, 116", "no"],  #страница 4
    'purc_all_magaz': ["338, 210", "216, 105, 12"],  # оранж кнопка, открывает выбор шмоток на закуп
    'close_magaz': ["382, 11", "168, 169, 171"],  # вроде правый верхнийц угол выход
    'confirm_orange_center': ["227, 151", "225, 125, 11"],  # оранж кнопка конфирм
    'lvl_up_close': ["100, 29", "no"],  # закрытие окна лвл апа
    'lvl_up_black': ["91, 174", "255, 255, 255"],  # белая стрелка окна с лвлапом, юзаем как триггер 1
    'lvl_up_black_2': ["56, 176", "247, 248, 248"],  # вторая хуйня слева от стрелки тоже белая, как триггер 2
    'white_cube_in_minimap': ["12, 62", "199, 199, 199"],  # кубик который находится в миникарте, по нему можно понять открыт ли нпс лист, а в дальнейшем понять находимся ли мы в городе
    'floran_no_energo_1': {
        'ru': ["27, 26", "44, 90, 127"],
        'jp': ["27, 26", "44, 90, 127"],
    },  # флоран, вне энерго, синий
    'floran_no_energo_2': {
        'ru': ["14, 26", "20, 84, 128"],
        'jp': ["14, 26", "20, 84, 128"],
    },  # флоран, вне энерго, синий
    'floran_no_energo_3': {
        'ru': ["63, 27", "150, 151, 151"],
        'jp': ["63, 27", "150, 151, 151"],
    },  # флоран, вне энерго, серый
    'floran_no_energo_4': {
        'ru': ["59, 27", "161, 162, 162"],
        'jp': ["59, 27", "161, 162, 162"],
    },  # флоран, вне энерго, серый средний
    'floran_no_energo_5': {
        'ru': ["52, 27", "191, 192, 192"],
        'jp': ["52, 27", "191, 192, 192"],
    },  # флоран, вне энерго, светло-серый
    'floran_no_energo_6': {
        'ru': ["13, 27", "43, 100, 138"],
        'jp': ["13, 27", "43, 100, 138"],
    },  # флоран, вне энерго, синий
    'floran_no_energo_7': {
        'ru': ["36, 25", "136, 132, 124"],
        'jp': ["36, 25", "136, 132, 124"],
    },  # флоран, вне энерго, тёплый бежевый
    'floran_no_energo_8': {
        'ru': ["40, 27", "168, 168, 165"],
        'jp': ["40, 27", "168, 168, 165"],
    },  # флоран, вне энерго, светло-серый нейтральный
    'floran_energo_1': {
        'ru': ["28, 43", "88, 88, 89"],
        'jp': ["28, 43", "88, 88, 89"],
    },  # флоран, в энерго, тёмно-серый
    'floran_energo_2': {
        'ru': ["71, 42", "142, 142, 144"],
        'jp': ["71, 42", "142, 142, 144"],
    },  # флоран, в энерго, серый средний
    'floran_energo_3': {
        'ru': ["75, 42", "96, 97, 100"],
        'jp': ["75, 42", "96, 97, 100"],
    },  # флоран, в энерго, тёмно-серый
    'floran_energo_4': {
        'ru': ["50, 41", "191, 191, 192"],
        'jp': ["50, 41", "191, 191, 192"],
    },  # флоран, в энерго, светло-серый
    'monetka_gui': ["213, 11", "219, 174, 93"],  # иконка монетки в гуи
    'diamond_gui': ["186, 9", "166, 172, 218"],  # иконка алмаза в гуи
    'energo_mode_gui': ["13, 132", "no"],  # кнопка для включения энерго режима, дальше нужно кликнуть в центр
    'auto_combat_mode_gui': ["323, 112", "no"],  # кнопка для включения/выключения автоохоты
    'monetka_energomode_gui': ["15, 53", "216, 193, 146"],  # монетка слева экрана
    'viewmode_change_btn': ["51, 211", "175, 176, 177"],  # можно юзать вместо алмазика при проверках тп
    'pvp_energo_trigger': ["367, 145", "220, 220, 220"],  # тригер пвп в энергорежиме, при виде него тпаем окно
    'energomode_center_gui': ["203, 103", "220, 220, 220"],  # 2 белые полоски по центру энергомода по ним + по оффлайн фарму детектим находимся ли мы в энергомоде
    'offline_play_energomode_gui': ["316, 199", "182, 82, 9"],  # белая буква кнопки оффлайн плея в энергорежиме
    'lvl_up_trigger': ["95, 172", "184, 13, 10"],  # когда апнул лвл в энерго режиме вылазит окно, это тригер на его существование
    'need_lvl_up': ["10, 204", "184, 13, 10"],  # это красная точка над лвлом, если есть то можем качнуть левл
    'lvl_up_activate1': ["17, 210", "no"],  # если значение выше (need_lvl_up) тру то можно кликнуть сюда чтоб открыть меню лвл апа
    'npc_list_in_town': ["79, 52", "no"],  # в городе кнопка которая открывает список нпс для авто-бега к ним
    'npc_list_1': ["17, 30", "no"],  # 1
    'npc_list_2': ["17, 45", "200, 142, 105"],  # 2 (тут возмозжен сундук)
    'npc_list_3': ["18, 61", "241, 220, 208"],  # 3 (тут возмозжен сундук)
    'npc_list_4': ["17, 75", "250, 244, 239"],  # 4 (тут возможен сундук)
    'npc_list_5': ["19, 90", "250, 241, 236"],  # 5 (тут возможен сундук)
    'npc_global_quit_button': ["377, 10", "no"],  # общая кнопка для всех нпс чтоб выйти из диалога
    'npc_shop_button_3': ["253, 152", "207, 91, 8"],  # кнопка у торговца, подтверждаем покупку
    'npc_shop_button_no_adena': ["243, 117", "214, 170, 100"],  # после того как выбрали предметы и нажали на покупку может дать окно о том, что адены нет
    'respawn_select_all': ["115, 131", "123, 126, 130"],
    'delete_exp': ["33, 160", "36, 43, 50"],
    'delete_all_yes': ["223, 152", "248, 231, 219"],
    'respawn_exp': ["29, 32", "no"],
    'respawn_items': ["76, 36", "no"],
    'respawn_exit_gui_button': ["120, 28", "no"],  # кнопка выхода из гуи
    'respawn_icon_in_gui': ["95, 175", "255, 255, 255"],  # рандом залупа в окне выкупа предметов, по ней детектим открытое окно
    'respawn_icon_in_gui_deleted': ["95, 175", "255, 102, 0"],  # оранжевый вариант той же точки
    'respawn_deleted_btn_1': ["111, 130", "29, 33, 39"],  # кнопка выделения всх в окне удалённых
    'respawn_deleted_btn_2': ["19, 162", "37, 44, 51"],  # кнопка удалить
    'respawn_deleted_btn_3': ["256, 145", "215, 102, 11"],  # оранжевая кнопка подтверждения после btn_2
    'krest_after_respawn': ["264, 9", "237, 209, 127"],  # после респавна можно нажать на крест и выкупить свои шмотки
    'respawn_monetka_exp_1': ["37, 55", "255, 233, 168"],
    'respawn_monetka_exp_2': ["37, 76", "255, 233, 168"],
    'respawn_monetka_exp_3': ["37, 96", "244, 203, 126"],
    'respawn_monetka_exp_4': ["37, 118", "254, 230, 175"],
    'home_scroll_button_energomode': ["373, 177", "144, 120, 101"],  # свиток телепорта в энергомоде
    'home_scroll_button_no_energomode': ["376, 197", "188, 168, 144"],  # свиток телепорта в обычном интерфейсе
    'spot_teleport_call_button': ["76, 29", "no"],  # кнопка вызова списка для телепорта на спот
    'spot_teleport_window_opened': ["92, 48", "160, 70, 10"], # желтая кнопка сейва когда окно тп открыто
    'spot_choice_1': ["72, 72", "no"],  # кнопка выбора первого спота
    'spot_choice_2': ["72, 89", "no"],  # кнопка выбора второго спота
    'spot_choice_3': ["72, 105", "no"],  # кнопка выбора третьего спота
    'spot_choice_4': ["72, 121", "no"],  # кнопка выбора четвертого спота
    'spot_accept_choice_1': ["94, 85", "255, 255, 255"],  # кнопка телепорта на первый спот
    'spot_accept_choice_2': ["94, 101", "255, 255, 255"],  # кнопка телепорта на второй спот
    'spot_accept_choice_3': ["94, 117", "255, 255, 255"],  # кнопка телепорта на третий спот
    'spot_accept_choice_4': ["94, 139", "255, 255, 255"],  # кнопка телепорта на четвертый спот
    'main_menu_gui': ["385, 6", "no"],  # кнопка в правом верхнем углу открывает меню
    'main_menu_opened': ["380, 8", "108, 115, 112"],  # пиксель виден только когда главное меню открыто
    'clan_1': ["61, 26", "185, 13, 10"],  # по этой залупе чекаем что прогрузилось, это красная точка около текста Clan
    'clan_5': ["353, 29", "151, 153, 156"],  # кнопка закрытия вкладки с выбором доната
    'clan_6': ["131, 156", "184, 13, 10"],  # после всех донатов и закрытия красная точка около получения наград, для выхода можно юзать цбт npc_global_quit_button
    'red_dot_achiv': ["367, 5", "193, 23, 17"],  # красная точка около ачивок
    'red_dot_achiv2': ["260, 27", "46, 32, 42"],  # вторая крсаня точка уже в меню ачивок
    'achiv_claim_1': ["363, 49", "215, 102, 11"],  # первая ачивка на клайм, можно дрюкать ее бесконечно пока не соберем все
    'red_dot_mail': ["70, 27", "193, 23, 17"],  # красная точка на почте в окне почты
    'clear_mail': ["198, 117", "30, 35, 42"],  # когда писем нет
    'red_dot_mail_clear': ["70, 27", "193, 23, 17"],
    'red_dot_daily_rewards': {
        "ru": ["307, 114", "182, 4, 5"],
        "jp": ["308, 113", "192, 23, 17"],
    }, # красная точка на дейлике
    'red_dot_daily_2': ["395, 34", "182, 4, 5"],  # красная точка когда уже открыл меню дейликов 1 вкладка
    'daily_rewards_claim_2': ["300, 202", "216, 106, 12"],  # сбор дейлика нижний #todo
    'monetka_proverka': ["246, 114", "176, 119, 33"],
    'confirm_buy_daily': ["234, 151", "206, 89, 8"],
    'battle_pass_red_dot_gui': {
        "ru": ["326, 170", "182, 4, 5"],
        "jp": ["325, 169", "193, 24, 18"],
    }, # красная точка в меню что батл пасс надо собирать
    'battle_pass_sbor_1': ["286, 61", "193, 24, 17"],  # сбор одной награды через Claim
    'battle_pass_sbor_2': ["386, 203", "185, 13, 10"],  # сбор всех наград через клейм ревард большую кнопку
    'battle_pass_sbor_2_2': ["342, 203", "185, 13, 10"],  # сбор всех наград через клейм ревард маленькую кнопку
    'battle_pass_empty': ["270, 24", "no"],  # пустота сверху, чтоб не перекрывать цвет мышью
    'auction_server_market_server': ["342, 16", "no"],  # наш сервер
    'auction_server_market_global': ["296, 14", "no"],  # глобал аук
    'auction_sold_red_dot': ["171, 26", "184, 14, 11"],  # вкладка продано, там можно собрать алмазы
    'auction_sold_claim': ["338, 203", "76, 83, 97"],  # сбор алмазов со вкладки продано
    'auction_sell_select_all_inactive': ["252, 204", "45, 49, 56"],  # во вкладке продажа выбор всего (перевыставление) когда оно неактивно
    'trash_god_statue_trigger_1': ["88, 202", "185, 130, 43"],  # если кликнули по неверному нпс то это статуя
    'trash_god_statue_trigger_2': ["282, 34", "149, 157, 176"],
    'trash_god_statue_trigger_3': ["22, 40", "255, 255, 255"],
    'trash_god_statue_trigger_4': ["230, 46", "103, 115, 128"],
    'error_disconnect_to_menu': ["192, 46", "234, 145, 94"],  # куда кликнуть для входа на серв | +
    'error_disconnect_to_menu_trigger1': ["192, 46", "234, 145, 94"],  # | +
    'error_disconnect_to_menu_trigger2': ["208, 127", "207, 145, 93"],  # | +
    'error_disconnect_to_menu_trigger3': ["191, 106", "244, 239, 173"],  # | +
    'error_disconnect_to_menu_trigger4': ["143, 83", "252, 248, 224"],  # | +
    'error_disconnect_to_menu_with_err': ["190, 150", "217, 109, 12"],  # куда кликнуть шоб закрыть табличку | +
    'enter_to_server': ["315, 199", "216, 105, 11"],  # выбор персов, просто кнопка Enter
    'error_disconnect_full': ["188, 151", "223, 148, 95"],  # куда кликнуть шоб закрыть окно после 10 мин афк
    'error_disconnect_full_trigger1': ["270, 103", "92, 94, 97"],
    'error_disconnect_full_trigger2': ["133, 100", "54, 56, 60"],
    'error_disconnect_full_trigger3': ["190, 101", "83, 85, 88"],
    'error_disconnect_full_trigger4': ["193, 103", "180, 180, 181"],
    'error_ethernet_1': ["202, 151", "224, 152, 101"],  # (P:3102:500)
    'error_ethernet_1_trigger1': ["166, 95", "59, 62, 65"],
    'error_ethernet_1_trigger2': ["221, 95", "117, 118, 120"],
    'error_ethernet_1_trigger3': ["135, 103", "114, 116, 118"],
    'error_ethernet_1_trigger4': ["265, 107", "104, 106, 109"],
    'party_dungeon_button': {
        'ru': ["120, 33", "90, 97, 108"],
        'jp': ["175, 34", "104, 112, 123"],
    },  # вкладка после нажатия на dungeon_button_menu
    'party_settings': ["16, 93", "no"], # выше чем energo_mode_gui на 1
    'autohunt_no_limit': {
        'ru': ["355, 202", "140, 145, 154"],
        'jp': ["378, 204", "148, 152, 158"],
    },  # первая стадия энерго кнопка с лимитом поиска цели "нет ограничений"
    'peace_on': {
        'ru': ["374, 187", "65, 73, 87"],
        'jp': ["373, 186", "159, 163, 170"],
    },  # мирный режим включен
    'peace_off': {
        'ru': ["374, 187", "49, 55, 65"],
        'jp': ["368, 186", "42, 48, 56"],
    },  # мирный режим выключен
    'schedule_menu': {
        'ru': ["279, 116", "no"],
        'jp': ["278, 115", "no"],
    },
    '3_vkladka': {
        'ru': ["232, 31", "31, 41, 53"],
        'jp': ["195, 38", "34, 46, 60"],
    },  # вкладка "адены"
    'buy_all_magaz': {
        'ru': ["248, 186", "216, 104, 11"],
        'jp': ["248, 191", "207, 90, 8"],
    },  # когда шмотки выбраны жмем купить
    'close_buy_magaz': {
        'ru': ["147, 188", "71, 79, 93"],
        'jp': ["159, 192", "181, 184, 189"],
    },  # закрытие магаза когда вкладка открыта и выбраны шмотки
    'zalupka_gui': {
        'ru': ["81, 28", "246, 246, 245"],
        'jp': ["79, 26", "253, 253, 253"],
    },  # залупка тест
    'you_were_killed_energomode_1': {
        'ru': ["192, 157", "98, 18, 32"],
        'jp': ["166, 153", "78, 15, 27"],
    },  # плашка о смерти в режиме энергосбереж "Вы погибли"
    'you_were_killed_energomode_2': {
        'ru': ["221, 158", "130, 23, 41"],
        'jp': ["209, 153", "60, 13, 22"],
    },
    'you_were_killed_energomode_3': {
        'ru': ["171, 157", "156, 27, 49"],
        'jp': ["233, 153", "155, 27, 48"],
    },
    'check_death_penalty_1': {
        'ru': ["228, 189", "121, 127, 135"],
        'jp': ["165, 184", "90, 97, 109"],
    },  # кнопка респавна после смерти от игрока
    'check_death_penalty_2': {
        'ru': ["163, 185", "153, 158, 165"],
        'jp': ["212, 183", "182, 186, 191"],
    },
    'check_death_penalty_3': {
        'ru': ["210, 190", "145, 149, 157"],
        'jp': ["188, 185", "140, 146, 155"],
    },
    'respawn_village_1': {
        'ru': ["163, 186", "196, 197, 200"],
        'jp': ["165, 185", "72, 80, 93"],
    },  # вторая кнопка респавна после смерти от хай лвл моба
    'respawn_village_2': {
        'ru': ["224, 186", "167, 168, 174"],
        'jp': ["232, 187", "83, 90, 101"],
    },
    'respawn_village_3': {
        'ru': ["163, 181", "68, 77, 90"],
        'jp': ["216, 186", "148, 152, 158"],
    },
    'auto_combat_ON': {
        'ru': ["193, 164", "69, 29, 4"],
        'jp': ["184, 160", "68, 29, 4"],
    },  # исчезающая надпись оранжевая Идет автоохота...
    'npc_list_6': {
        'ru': ["17, 104", "250, 244, 239"],
        'jp': ["17, 104", "no"],
    },  # 6 (тут возможен сундук)
    'npc_stash_button_1': {
        'ru': ["334, 204", "173, 177, 182"],
        'jp': ["334, 204", "228, 229, 231"],
    },  # кнопка у складовщика Автохранение, по ней мы чекаем что добежали к складу
    'npc_stash_button_2': {
        'ru': ["376, 204", "233, 168, 110"],
        'jp': ["376, 204", "252, 245, 239"],
    },  # кнопка у складовщика На хранение, по ней мы чекаем что складываем не пустоту
    'npc_shop_button_1': {
        'ru': ["331, 206", "60, 67, 79"],
        'jp': ["330, 206", "98, 104, 113"],
    },  # кнопка у торговца, по ней мы чекаем что дошли к нему
    'npc_shop_button_2': {
        'ru': ["364, 206", "239, 201, 174"],
        'jp': ["364, 205", "249, 235, 225"],
    },  # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    'npc_shop_button_no_adena_confirm': {
        'ru': ["191, 147", "216, 105, 12"],
        'jp': ["189, 150", "230, 157, 92"],
    },  # подтверждение о покупке адены
    'npc_buyer_button_1': {
        'ru': ["298, 205", "196, 198, 202"],
        'jp': ["297, 204", "241, 242, 243"],
    },  # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    'npc_buyer_button_2': {
        'ru': ["364, 204", "242, 204, 170"],
        'jp': ["364, 205", "249, 235, 225"],
    },  # кнопка у скупщика, такая же как npc_shop_button_2"
    'npc_buyer_button_3': {
        'ru': ["254, 152", "207, 91, 8"],
        'jp': ["253, 152", "207, 91, 8"],
    },  # кнопка у скупщика, такая же как npc_shop_button_3
    'npc_shop_anchor_1': ["14, 207", "61, 69, 81"],  # якорь диалога бакалеи
    'npc_shop_anchor_2': ["15, 49", "27, 32, 39"],
    'npc_shop_anchor_3': ["269, 184", "214, 170, 100"],
    'npc_stash_anchor_1': ["269, 184", "214, 170, 100"],  # якорь диалога склада
    'npc_stash_anchor_2': ["106, 198", "113, 98, 61"],
    'npc_stash_anchor_3': ["294, 40", "25, 31, 37"],
    'npc_buyer_anchor_1': ["269, 184", "214, 170, 100"],  # якорь диалога скупа
    'npc_buyer_anchor_2': ["16, 90", "32, 36, 43"],
    'monetka_respawn': {
        'ru': ["103, 132", "223, 183, 120"],
        'jp': ["103, 131", "182, 127, 38"],
    },  # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    'respawn_buy_gui_button': {
        'ru': ["60, 157", "139, 143, 147"],
        'jp': ["60, 156", "143, 147, 151"],
    },  # кнопка после выбора того что выкупать, подтверждаем
    'respawn_accept_buy_gui_button': {
        'ru': ["222, 148", "216, 106, 12"],
        'jp': ["222, 148", "244, 214, 188"],
    },  # кнопка подтверждения покупки выкупа
    'hp_bank_in_energo': {
        'ru': ["167, 197", "95, 95, 95"],
        'jp': ["178, 197", "95, 95, 95"],
    },  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'soska_in_energo': {
        'ru': ["188, 204", "39, 39, 39"],
        'jp': ["205, 199", "35, 35, 35"],
    },  # когда сосок 0
    'pereves0': {
        'ru': ["249, 200", "67, 67, 68"],
        'jp': ["242, 194", "67, 67, 68"],
    },  # когда перевеса нет
    'pereves1': {
        'ru': ["249, 200", "199, 40, 40"],
        'jp': ["242, 194", "199, 40, 40"],
    },  # оражневый перевес 50%
    'pereves2': {
        'ru': ["249, 200", "188, 90, 5"],
        'jp': ["242, 194", "188, 90, 5"],
    },  # красный перевес 80%
    'q_quiver': {
        'ru': ["135, 205", "1, 1, 2"],
        'jp': ["147, 204", "1, 1, 2"],
    },  # колчан когда его нет
    'q_hp_bank_in_energo': {
        'ru': ["178, 197", "60, 60, 60"],
        'jp': ["189, 196", "47, 47, 47"],
    },  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'q_soska_in_energo': {
        'ru': ["204, 200", "55, 55, 55"],
        'jp': ["216, 199", "35, 35, 35"],
    },  # когда сосок 0
    'q_pereves0': {
        'ru': ["259, 200", "67, 67, 68"],
        'jp': ["252, 194", "67, 67, 68"],
    },  # когда перевеса нет
    'q_pereves1': {
        'ru': ["259, 200", "199, 40, 40"],
        'jp': ["252, 194", "199, 40, 40"],
    },  # оражневый перевес 50%
    'q_pereves2': {
        'ru': ["259, 200", "188, 90, 5"],
        'jp': ["252, 194", "188, 90, 5"],
    },  # красный перевес 80%
    'yes_button_vitality': {
        'ru': ["216, 145", "215, 102, 11"],
        'jp': ["215, 145", "215, 102, 11"],
    },  # когда вылезла табличка шо уже лимит
    'cancel_button_vitality': {
        'ru': ["156, 148", "171, 175, 181"],
        'jp': ["158, 150", "117, 123, 133"],
    },
    'red_dot_clan': {
        'ru': ["366, 87", "184, 13, 10"],
        'jp': ["366, 60", "184, 13, 10"],
    },  # красная точка около клана
    'clan_2': {
        'ru': ["204, 205", "97, 85, 53"],
        'jp': ["204, 205", "189, 184, 171"],
    },  # кнопка донат
    'clan_3': {
        'ru': ["67, 178", "238, 187, 143"],
        'jp': ["67, 178", "241, 200, 164"],
    },  # после доната выбор адены
    'achiv_claim_accept': {
        'ru': ["174, 165", "208, 92, 9"],
        'jp': ["178, 164", "235, 187, 152"],
    },  # подтверждение сбора ачивки
    'red_dot_mail_menu': {
        'ru': ["308, 170", "185, 13, 10"],
        'jp': ["306, 169", "193, 24, 18"],
    },  # красная точка на почте в меню
    'claim_all_mail': {
        'ru': ["346, 205", "207, 92, 13"],
        'jp': ["346, 205", "222, 144, 89"],
    },  # собрать всю почту
    'daily_rewards_claim_1': {
        'ru': ["299, 95", "215, 102, 11"],
        'jp': ["299, 96", "215, 103, 11"],
    },  # сбор дейлика верхний
    'auction_menu': {
        'ru': ["303, 90", "no"],
        'jp': ["306, 90", "no"],
    },  # открытие аука через меню
    'auction_nalog': {
        'ru': ["29, 32", "133, 120, 122"],
        'jp': ["263, 33", "170, 157, 159"],
    },  # белый текст налог в окне аука, проверяем что он открыт
    'auction_sell_page': {
        'ru': ["95, 30", "no"],
        'jp': ["95, 31", "no"],
    },  # вклада продажа
    'auction_sell_select_all_active': {
        'ru': ["252, 204", "158, 163, 170"],
        'jp': ["252, 204", "155, 160, 167"],
    },  # во вкладке продажа выбор всего (перевыставление)
    'auction_sell_reregister_active': {
        'ru': ["351, 203", "70, 78, 92"],
        'jp': ["351, 203", "101, 108, 119"],
    },  # перевыставление когда шмот выбран
    'auction_sell_reregister_confirm': {
        'ru': ["206, 151", "206, 89, 8"],
        'jp': ["204, 151", "206, 89, 8"],
    },  # подтверждение перевыставления за адену
    'alliance_menu_gui': {
        'ru': ["380, 89", "no"],
    },
    'alliance_donate_global_button': {
        'ru': ["183, 199", "113, 99, 62"],
    },
    'alliance_donate_1_button': {
        'ru': ["58, 174", "215, 103, 11"],
    },
    'alliance_donate_2_button': {
        'ru': ["164, 184", "209, 95, 9"],
    },
    'alliance_close_donate': {
        'ru': ["357, 31", "36, 40, 47"],
    },
    'error_disconnect_to_menu_with_err_trigger1': {
        'ru': ["151, 95", "135, 136, 138"],
        'jp': ["150, 106", "102, 104, 106"],
    },  # | +
    'error_disconnect_to_menu_with_err_trigger2': {
        'ru': ["244, 106", "113, 115, 117"],
        'jp': ["249, 106", "113, 115, 117"],
    },  # | +
    'error_disconnect_to_menu_with_err_trigger3': {
        'ru': ["248, 98", "182, 183, 183"],
        'jp': ["194, 98", "129, 130, 132"],
    },  # | +
    'error_disconnect_to_menu_with_err_trigger4': {
        'ru': ["157, 105", "154, 155, 156"],
        'jp': ["237, 98", "83, 85, 88"],
    },  # | +
    'party_close': ["264, 30", "151, 154, 157"],
    'party_settings_me': ["262, 121", "15, 18, 22"],
    'party_settings_me2': ["262, 121", "no"],
    'party_group': {
        'ru': ["16, 80", "no"],
        'jp': ["16, 80", "no"],
    },
    'party_dungeon_create_button': {
        'ru': ["212, 193", "217, 107, 12"],
        'jp': ["212, 193", "217, 107, 12"],
    },
    'party_leave_1': {
        'ru': ["66, 72", "255, 255, 255"],
        'jp': ["66, 72", "255, 255, 255"],
    },
    'party_leave_2': {
        'ru': ["208, 147", "216, 105, 12"],
        'jp': ["208, 147", "216, 105, 12"],
    },
}
