from bot.cbt.base import CBT_BASE

CBT_JP = dict(CBT_BASE)
CBT_JP.update({
    'party_dungeon_button': ["135, 33", "90, 98, 109"],  # вкладка после нажатия на dungeon_button_menu
    'party_group': ["16, 80", "no"],  # хуйня для японии шоб пати было для группы, снизу - клан, сверху пати, по центру плюсик
    'party_settings': ["16, 93", "no"],  # выше чем energo_mode_gui на 1
    'party_dungeon_create_button': ["212, 193", "217, 107, 12"],
    'party_leave_1': ["66, 72", "255, 255, 255"],
    'party_leave_2': ["208, 147", "216, 105, 12"],
    'autohunt_no_limit': ["378, 204", "148, 152, 158"],  # первая стадия энерго кнопка с лимитом поиска цели "нет ограничений"
    'peace_on': ["373, 186", "159, 163, 170"],  # мирный режим включен
    'peace_off': ["368, 186", "42, 48, 56"],  # мирный режим выключен
    'schedule_menu': ["278, 115", "no"],
    '3_vkladka': ["195, 38", "34, 46, 60"],
    'buy_all_magaz': ["248, 191", "207, 90, 8"],  # когда шмотки выбраны жмем купить
    'close_buy_magaz': ["159, 192", "181, 184, 189"],  # закрытие магаза когда вкладка открыта и выбраны шмотки
    'zalupka_gui': ["79, 26", "253, 253, 253"],  # залупка тест
    'you_were_killed_energomode_1': ["166, 153", "78, 15, 27"],  # плашка о смерти в режиме энергосбереж
    'you_were_killed_energomode_2': ["209, 153", "60, 13, 22"],
    'you_were_killed_energomode_3': ["233, 153", "155, 27, 48"],
    'check_death_penalty_1': ["165, 184", "90, 97, 109"],  # кнопка респавна после смерти от игрока
    'check_death_penalty_2': ["212, 183", "182, 186, 191"],
    'check_death_penalty_3': ["188, 185", "140, 146, 155"],
    'respawn_village_1': ["165, 185", "72, 80, 93"],  # вторая кнопка респавна после смерти от хай лвл моба
    'respawn_village_2': ["232, 187", "83, 90, 101"],
    'respawn_village_3': ["216, 186", "148, 152, 158"],
    'auto_combat_ON': ["184, 160", "68, 29, 4"],  # исчезающая надпись оранжевая Huntng...
    'npc_list_6': ["17, 104", "no"],  # 6
    'npc_stash_button_1': ["334, 204", "228, 229, 231"],  # кнопка у складовщика Auto-Stash, по ней мы чекаем что добежали к складу
    'npc_stash_button_2': ["376, 204", "252, 245, 239"],  # кнопка у складовщика Deposit All, по ней мы чекаем что складываем не пустоту
    'npc_shop_button_1': ["330, 206", "98, 104, 113"],  # кнопка у торговца, по ней мы чекаем что дошли к нему
    'npc_shop_button_2': ["364, 205", "249, 235, 225"],  # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    'npc_shop_button_no_adena_confirm': ["189, 150", "230, 157, 92"],  # подтверждение о покупке адены
    'npc_buyer_button_1': ["297, 204", "241, 242, 243"],  # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    'npc_buyer_button_2': ["364, 205", "249, 235, 225"],  # кнопка у скупщика, такая же как npc_shop_button_2"
    'npc_buyer_button_3': ["253, 152", "207, 91, 8"],  # кнопка у скупщика, такая же как npc_shop_button_3
    'monetka_respawn': ["103, 131", "182, 127, 38"],  # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    'respawn_buy_gui_button': ["60, 156", "143, 147, 151"],  # кнопка после выбора того что выкупать, подтверждаем
    'respawn_accept_buy_gui_button': ["222, 148", "244, 214, 188"],  # кнопка подтверждения покупки выкупа
    'hp_bank_in_energo': ["178, 197", "95, 95, 95"],  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'soska_in_energo': ["205, 199", "35, 35, 35"],  # когда сосок 0
    'pereves0': ["242, 194", "67, 67, 68"],  # когда перевеса нет
    'pereves1': ["242, 194", "199, 40, 40"],  # красный перевес 80%
    'pereves2': ["242, 194", "188, 90, 5"],  # оражневый перевес 50%
    'q_quiver': ["147, 204", "1, 1, 2"],  # колчан когда его нет
    'q_hp_bank_in_energo': ["189, 196", "47, 47, 47"],  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'q_soska_in_energo': ["216, 199", "35, 35, 35"],  # когда сосок 0
    'q_pereves0': ["252, 194", "67, 67, 68"],  # когда перевеса нет
    'q_pereves1': ["252, 194", "199, 40, 40"],  # красный перевес 80%
    'q_pereves2': ["252, 194", "188, 90, 5"],  # оражневый перевес 50%
    'yes_button_vitality': ["215, 145", "215, 102, 11"],  # когда вылезла табличка шо уже лимит
    'cancel_button_vitality': ["158, 150", "117, 123, 133"],
    'red_dot_clan': ["366, 60", "184, 13, 10"],  # красная точка около клана
    'clan_2': ["204, 205", "189, 184, 171"],  # кнопка донат
    'clan_3': ["67, 178", "241, 200, 164"],  # после доната выбор адены
    'achiv_claim_accept': ["178, 164", "235, 187, 152"],  # подтверждение сбора ачивки
    'red_dot_mail_menu': ["307, 170", "182, 4, 5"],  # красная точка на почте в меню
    'claim_all_mail': ["346, 205", "222, 144, 89"],  # собрать всю почту
    'daily_rewards_claim_1': ["299, 96", "215, 103, 11"],  # сбор дейлика верхний
    'auction_nalog': ["263, 33", "170, 157, 159"],  # белый текст налог в окне аука, проверяем что он открыт
    'auction_menu': ["306, 90", "no"],  # открытие аука через меню
    'auction_sell_page': ["95, 31", "no"],  # вклада продажа
    'auction_sell_select_all_active': ["252, 204", "155, 160, 167"],  # во вкладке продажа выбор всего (перевыставление)
    'auction_sell_reregister_active': ["351, 203", "101, 108, 119"],  # перевыставление когда шмот выбран
    'auction_sell_reregister_confirm': ["204, 151", "206, 89, 8"],  # подтверждение перевыставления за адену
    'error_disconnect_to_menu_with_err_trigger1': ["150, 106", "102, 104, 106"],
    'error_disconnect_to_menu_with_err_trigger2': ["249, 106", "113, 115, 117"],
    'error_disconnect_to_menu_with_err_trigger3': ["194, 98", "129, 130, 132"],
    'error_disconnect_to_menu_with_err_trigger4': ["237, 98", "83, 85, 88"],
})
