from bot.cbt.base import CBT_BASE

CBT_RU = dict(CBT_BASE)
CBT_RU.update({
    'party_dungeon_button': ["176, 33", "125, 131, 140"],  # вкладка после нажатия на dungeon_button_menu
    'party_settings': ["16, 117", "no"],  # выше чем energo_mode_gui на 1
    'autohunt_no_limit': ["385, 203", "126, 132, 142"],  # первая стадия энерго кнопка с лимитом поиска цели "нет ограничений"
    'peace_on': ["374, 187", "65, 73, 87"],  # мирный режим включен
    'peace_off': ["374, 187", "49, 55, 65"],  # мирный режим выключен
    'schedule_menu': ["279, 116", "no"],
    '3_vkladka': ["232, 31", "31, 41, 53"], # вкладка "адены"
    'buy_all_magaz': ["248, 186", "216, 104, 11"],  # когда шмотки выбраны жмем купить
    'close_buy_magaz': ["147, 188", "71, 79, 93"],  # закрытие магаза когда вкладка открыта и выбраны шмотки
    'zalupka_gui': ["81, 28", "246, 246, 245"],  # залупка тест
    'you_were_killed_energomode_1': ["192, 157", "98, 18, 32"],  # плашка о смерти в режиме энергосбереж "Вы погибли"
    'you_were_killed_energomode_2': ["221, 158", "130, 23, 41"],
    'you_were_killed_energomode_3': ["171, 157", "156, 27, 49"],
    'check_death_penalty_1': ["228, 189", "121, 127, 135"],  # кнопка респавна после смерти от игрока
    'check_death_penalty_2': ["163, 185", "153, 158, 165"],
    'check_death_penalty_3': ["210, 190", "145, 149, 157"],
    'respawn_village_1': ["163, 186", "196, 197, 200"],  # вторая кнопка респавна после смерти от хай лвл моба
    'respawn_village_2': ["224, 186", "167, 168, 174"],
    'respawn_village_3': ["163, 181", "68, 77, 90"],
    'auto_combat_ON': ["193, 164", "69, 29, 4"],  # исчезающая надпись оранжевая Идет автоохота...
    'npc_list_6': ["17, 104", "250, 244, 239"],  # 6 (тут возможен сундук)
    'npc_stash_button_1': ["334, 204", "173, 177, 182"],  # кнопка у складовщика Автохранение, по ней мы чекаем что добежали к складу
    'npc_stash_button_2': ["376, 204", "233, 168, 110"],  # кнопка у складовщика На хранение, по ней мы чекаем что складываем не пустоту
    'npc_shop_button_1': ["331, 206", "60, 67, 79"],  # кнопка у торговца, по ней мы чекаем что дошли к нему
    'npc_shop_button_2': ["364, 206", "239, 201, 174"],  # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    'npc_shop_button_no_adena_confirm': ["191, 147", "216, 105, 12"],  # подтверждение о покупке адены
    'npc_buyer_button_1': ["298, 205", "196, 198, 202"],  # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    'npc_buyer_button_2': ["364, 204", "242, 204, 170"],  # кнопка у скупщика, такая же как npc_shop_button_2"
    'npc_buyer_button_3': ["254, 152", "207, 91, 8"],  # кнопка у скупщика, такая же как npc_shop_button_3
    'monetka_respawn': ["103, 132", "223, 183, 120"],  # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    'respawn_buy_gui_button': ["60, 157", "139, 143, 147"],  # кнопка после выбора того что выкупать, подтверждаем
    'respawn_accept_buy_gui_button': ["222, 148", "216, 106, 12"],  # кнопка подтверждения покупки выкупа
    'hp_bank_in_energo': ["167, 197", "95, 95, 95"],  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'soska_in_energo': ["188, 204", "39, 39, 39"],  # когда сосок 0
    'pereves0': ["249, 200", "67, 67, 68"],  # когда перевеса нет
    'pereves1': ["249, 200", "199, 40, 40"],  # оражневый перевес 50%
    'pereves2': ["249, 200", "188, 90, 5"],  # красный перевес 80%
    'q_quiver': ["135, 205", "1, 1, 2"],  # колчан когда его нет
    'q_hp_bank_in_energo': ["178, 197", "60, 60, 60"],  # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    'q_soska_in_energo': ["204, 200", "55, 55, 55"],  # когда сосок 0
    'q_pereves0': ["259, 200", "67, 67, 68"],  # когда перевеса нет
    'q_pereves1': ["259, 200", "199, 40, 40"],  # оражневый перевес 50%
    'q_pereves2': ["259, 200", "188, 90, 5"],  # красный перевес 80%
    'yes_button_vitality': ["216, 145", "215, 102, 11"],
    'cancel_button_vitality': ["156, 148", "171, 175, 181"],
    'red_dot_clan': ["366, 87", "184, 13, 10"],  # красная точка около клана
    'clan_2': ["204, 205", "97, 85, 53"],  # кнопка донат
    'clan_3': ["67, 178", "238, 187, 143"],  # после доната выбор адены
    'achiv_claim_accept': ["174, 165", "208, 92, 9"],  # подтверждение сбора ачивки
    'red_dot_mail_menu': ["308, 170", "185, 13, 10"],  # красная точка на почте в меню
    'claim_all_mail': ["346, 205", "207, 92, 13"],  # собрать всю почту
    'daily_rewards_claim_1': ["299, 95", "215, 102, 11"],  # сбор дейлика верхний
    'auction_menu': ["303, 90", "no"],  # открытие аука через меню
    'auction_nalog': ["29, 32", "133, 120, 122"],  # белый текст налог в окне аука, проверяем что он открыт
    'auction_sell_page': ["95, 30", "no"],  # вклада продажа
    'auction_sell_select_all_active': ["252, 204", "158, 163, 170"],  # во вкладке продажа выбор всего (перевыставление)
    'auction_sell_reregister_active': ["351, 203", "70, 78, 92"],  # перевыставление когда шмот выбран
    'auction_sell_reregister_confirm': ["206, 151", "206, 89, 8"],  # подтверждение перевыставления за адену
    'alliance_menu_gui': ["380, 89", "no"],
    'alliance_donate_global_button': ["183, 199", "113, 99, 62"],
    'alliance_donate_1_button': ["58, 174", "215, 103, 11"],
    'alliance_donate_2_button': ["164, 184", "209, 95, 9"],
    'alliance_close_donate': ["357, 31", "36, 40, 47"],
    'error_disconnect_to_menu_with_err_trigger1': ["151, 95", "135, 136, 138"],  # | +
    'error_disconnect_to_menu_with_err_trigger2': ["244, 106", "113, 115, 117"],  # | +
    'error_disconnect_to_menu_with_err_trigger3': ["248, 98", "182, 183, 183"],  # | +
    'error_disconnect_to_menu_with_err_trigger4': ["157, 105", "154, 155, 156"],  # | +
})
