import os

ROOT_DIR = os.path.abspath(os.path.join(os.path.dirname(__file__), ".."))
LOG_DIR = os.path.join(ROOT_DIR, "logs")
PROFILES_DIR = os.path.join(ROOT_DIR, "profiles")
SETTINGS_DIR = os.path.join(ROOT_DIR, "settings")
SCREENSHOT_DIR = os.path.join(ROOT_DIR, "screenshots")

# методом getNPCposition - получим список доступных нпс и их позиции
NPCS = [
    "stash", "shop", "buyer"
]

# кнопки в интерфейсе каждого нпс, по ним проверяем что дошли
NPC_CHECK_BUTTONS = {
    "stash": "npc_stash_button_1",
    "shop": "npc_shop_button_1",
    "buyer": "npc_buyer_button_1",
}

CBT_RU = {
    "party_dungeon_hard_1": ["266, 45", "no"],
    "party_dungeon_hard_2": ["266, 65", "no"],
    "party_dungeon_hard_3": ["266, 85", "no"],
    "party_dungeon_hard_4": ["266, 105", "no"],
    "party_dungeon_join": ["367, 205", "206, 89, 8"], # Заявка на вход
    "party_dungeon_join2": ["211, 146", "215, 104, 11"], # Заявка на вход после выбора сложности
    "party_dungeon_join3": ["213, 196", "207, 91, 8"], # после клика на портал
    "party_dungeon_button": ["176, 33", "125, 131, 140"], # вкладка после нажатия на dungeon_button_menu
    "dungeon_button_menu": ["322, 97", "no"], # подземелья в меню

    "party_settings": ["16, 117", "no"], # выше чем energo_mode_gui на 1
    "party_settings_me": ["262, 121", "15, 18, 22"],

    "autohunt_no_limit": ["385, 203", "176, 180, 186"], # первая стадия энерго кнопка с лимитом поиска цели "нет ограничений"
    "peace_on": ["374, 187", "65, 73, 87"], # мирный режим включен
    "peace_off": ["374, 187", "49, 55, 65"],  # мирный режим выключен

    "schedule_menu": ["279, 116", "no"],
    "schedule_start": ["299, 199", "215, 102, 11"],
    "schedule_stop": ["303, 199", "113, 98, 61"],

    "magaz_monetka_reklama": ["214, 12", "24, 15, 7"],
    "magaz_circle_close": ["16, 183", "no"], # кругляш который закрывает баннер на веки
    "magaz_reklama_close": ["12, 185", "no"],
    "magaz_google_close": ["379, 16", "61, 63, 61"],
    "magaz_reklama_trigger": ["101, 196", "46, 46, 46"], # реклама в магазе, если ее видим то жмем по magaz_reklama_close
    "magaz_google_trigger": ["281, 122", "255, 255, 255"], # вторая реклама, закрывается magaz_google_close
    "magaz_gui_open": ["302, 12", "no"], # магазин донат
    "red_dot_magaz": ["173, 27", "193, 23, 17"], # красная точка в магазе внутри магаз интерфейса
    "3_vkladka": ["147, 35", "34, 45, 62"],
    "magaz_str_1": ["339, 53", "no"], #страница 1
    "magaz_str_2": ["356, 77", "no"], #страница 2
    "magaz_str_3": ["353, 97", "no"], #страница 3
    "magaz_str_4": ["352, 116", "no"], #страница 4
    "purc_all_magaz": ["338, 210", "216, 105, 12"], # оранж кнопка, открывает выбор шмоток на закуп
    "buy_all_magaz": ["248, 186", "216, 104, 11"], # когда шмотки выбраны жмем купить
    "close_buy_magaz": ["147, 188", "71, 79, 93"], # закрытие магаза когда вкладка открыта и выбраны шмотки
    "close_magaz": ["382, 11", "168, 169, 171"], # вроде правый верхнийц угол выход
    "confirm_orange_center": ["227, 151", "225, 125, 11"], # оранж кнопка конфирм

    "lvl_up_close": ["100, 29", "no"], # закрытие окна лвл апа
    "lvl_up_black": ["91, 174", "255, 255, 255"], # белая стрелка окна с лвлапом, юзаем как триггер 1
    "lvl_up_black_2": ["56, 176", "247, 248, 248"], # вторая хуйня слева от стрелки тоже белая, как триггер 2
    "white_cube_in_minimap": ["12, 62", "199, 199, 199"], # кубик который находится в миникарте, по нему можно понять открыт ли нпс лист, а в дальнейшем понять находимся ли мы в городе
    "monetka_gui": ["213, 11", "219, 174, 93"], # иконка монетки в гуи
    "diamond_gui": ["186, 9", "166, 172, 218"], # иконка алмаза в гуи
    "zalupka_gui": ["81, 28", "246, 246, 245"], # залупка тест
    "you_were_killed_energomode_1": ["192, 157", "98, 18, 32"], # плашка о смерти в режиме энергосбереж "Вы погибли"
    "you_were_killed_energomode_2": ["221, 158", "130, 23, 41"],
    "you_were_killed_energomode_3": ["171, 157", "156, 27, 49"],
    "check_death_penalty_1": ["228, 189", "121, 127, 135"], # кнопка респавна после смерти от игрока
    "check_death_penalty_2": ["163, 185", "153, 158, 165"],
    "check_death_penalty_3": ["210, 190", "145, 149, 157"],
    "respawn_village_1": ["163, 186", "196, 197, 200"], # вторая кнопка респавна после смерти от хай лвл моба
    "respawn_village_2": ["224, 186", "167, 168, 174"],
    "respawn_village_3": ["163, 181", "68, 77, 90"],

    "energo_mode_gui": ["13, 132", "no"], # кнопка для включения энерго режима, дальше нужно кликнуть в центр
    "auto_combat_mode_gui": ["323, 112", "no"], # кнопка для включения/выключения автоохоты
    "auto_combat_ON": ["193, 164", "69, 29, 4"], # исчезающая надпись оранжевая Идет автоохота...
    "monetka_energomode_gui": ["15, 53", "216, 193, 146"], # монетка слева экрана
    "viewmode_change_btn": ["51, 211", "175, 176, 177"], # можно юзать вместо алмазика при проверках тп
    "pvp_energo_trigger": ["367, 145", "220, 220, 220"], # тригер пвп в энергорежиме, при виде него тпаем окно

    "energomode_center_gui": ["203, 103", "220, 220, 220"], # 2 белые полоски по центру энергомода по ним + по оффлайн фарму детектим находимся ли мы в энергомоде
    "offline_play_energomode_gui": ["316, 199", "182, 82, 9"], # белая буква кнопки оффлайн плея в энергорежиме

    "lvl_up_trigger": ["95, 172", "184, 13, 10"], # когда апнул лвл в энерго режиме вылазит окно, это тригер на его существование
    "need_lvl_up": ["10, 204", "184, 13, 10"], # это красная точка над лвлом, если есть то можем качнуть левл
    "lvl_up_activate1": ["17, 210", "no"], # если значение выше (need_lvl_up) тру то можно кликнуть сюда чтоб открыть меню лвл апа

    "npc_list_in_town": ["79, 52", "no"], # в городе кнопка которая открывает список нпс для авто-бега к ним
    "npc_list_1": ["17, 30", "no"], # 1
    "npc_list_2": ["17, 45", "200, 142, 105"], # 2 (тут возмозжен сундук)
    "npc_list_3": ["18, 61", "241, 220, 208"], # 3 (тут возмозжен сундук)
    "npc_list_4": ["17, 75", "250, 244, 239"], # 4 (тут возможен сундук)
    "npc_list_5": ["19, 90", "250, 241, 236"], # 5 (тут возможен сундук)
    "npc_list_6": ["17, 104", "250, 244, 239"], # 6 (тут возможен сундук)

    "npc_global_quit_button": ["377, 10", "no"], # общая кнопка для всех нпс чтоб выйти из диалога
    "npc_stash_button_1": ["334, 204", "173, 177, 182"], # кнопка у складовщика Автохранение, по ней мы чекаем что добежали к складу
    "npc_stash_button_2": ["376, 204", "233, 168, 110"], # кнопка у складовщика На хранение, по ней мы чекаем что складываем не пустоту
    "npc_shop_button_1": ["331, 206", "60, 67, 79"], # кнопка у торговца, по ней мы чекаем что дошли к нему
    "npc_shop_button_2": ["364, 206", "239, 201, 174"], # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    "npc_shop_button_3": ["253, 152", "207, 91, 8"], # кнопка у торговца, подтверждаем покупку
    "npc_shop_button_no_adena": ["243, 117", "214, 170, 100"], # после того как выбрали предметы и нажали на покупку может дать окно о том, что адены нет
    "npc_shop_button_no_adena_confirm": ["191, 147", "216, 105, 12"], # подтверждение о покупке адены
    "npc_buyer_button_1": ["298, 205", "196, 198, 202"], # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    "npc_buyer_button_2": ["364, 204", "242, 204, 170"], # кнопка у скупщика, такая же как npc_shop_button_2"
    "npc_buyer_button_3": ["254, 152", "207, 91, 8"], # кнопка у скупщика, такая же как npc_shop_button_3

    "respawn_select_all": ["115, 131", "123, 126, 130"],
    "delete_exp": ["33, 160", "36, 43, 50"],
    "delete_all_yes": ["223, 152", "248, 231, 219"],
    "respawn_exp": ["29, 32", "no"],
    "respawn_items": ["76, 36", "no"],
    "respawn_exit_gui_button": ["120, 28", "no"], # кнопка выхода из гуи
    "respawn_icon_in_gui": ["95, 175", "255, 255, 255"], # рандом залупа в окне выкупа предметов, по ней детектим открытое окно
    "monetka_respawn": ["103, 132", "223, 183, 120"], # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    "krest_after_respawn": ["263, 13", "no"], # после респавна можно нажать на крест и выкупить свои шмотки
    "respawn_monetka_exp_1": ["37, 55", "255, 233, 168"],
    "respawn_monetka_exp_2": ["37, 76", "255, 233, 168"],
    "respawn_monetka_exp_3": ["37, 96", "244, 203, 126"],
    "respawn_monetka_exp_4": ["37, 118", "254, 230, 175"],
    "respawn_buy_gui_button": ["60, 157", "139, 143, 147"], # кнопка после выбора того что выкупать, подтверждаем
    "respawn_accept_buy_gui_button": ["222, 148", "216, 106, 12"], # кнопка подтверждения покупки выкупа

    "home_scroll_button_energomode": ["373, 177", "144, 120, 101"], # свиток телепорта в энергомоде
    "home_scroll_button_no_energomode": ["376, 197", "188, 168, 144"], # свиток телепорта в обычном интерфейсе

    "spot_teleport_call_button": ["76, 29", "no"], # кнопка вызова списка для телепорта на спот
    "spot_choice_1": ["72, 72", "no"], # кнопка выбора первого спота
    "spot_choice_2": ["72, 89", "no"], # кнопка выбора второго спота
    "spot_choice_3": ["72, 105", "no"], # кнопка выбора третьего спота
    "spot_choice_4": ["72, 121", "no"], # кнопка выбора четвертого спота

    "spot_accept_choice_1": ["94, 85", "255, 255, 255"], # кнопка телепорта на первый спот
    "spot_accept_choice_2": ["94, 101", "255, 255, 255"], # кнопка телепорта на второй спот
    "spot_accept_choice_3": ["94, 117", "255, 255, 255"], # кнопка телепорта на третий спот
    "spot_accept_choice_4": ["94, 139", "255, 255, 255"], # кнопка телепорта на четвертый спот

    # без колчана без супер сосок (когда они оффнуты либо их 0)
    "hp_bank_in_energo": ["167, 197", "95, 95, 95"], # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    "soska_in_energo": ["188, 204", "39, 39, 39"], # когда сосок 0
    "pereves0": ["249, 200", "67, 67, 68"], # когда перевеса нет
    "pereves1": ["249, 200", "199, 40, 40"],  # оражневый перевес 50%
    "pereves2": ["249, 200", "188, 90, 5"], # красный перевес 80%

    # с колчаном без супер сосок (когда они оффнуты либо их 0)
    "q_quiver": ["135, 205", "1, 1, 2"], # колчан когда его нет
    "q_hp_bank_in_energo": ["178, 197", "60, 60, 60"], # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    "q_soska_in_energo": ["204, 200", "55, 55, 55"],  # когда сосок 0
    "q_pereves0": ["259, 200", "67, 67, 68"], # когда перевеса нет
    "q_pereves1": ["259, 200", "199, 40, 40"],  # оражневый перевес 50%
    "q_pereves2": ["259, 200", "188, 90, 5"], # красный перевес 80%

    "yes_button_vitality": ["216, 145", "215, 102, 11"],
    "cancel_button_vitality": ["156, 148", "171, 175, 181"],

    "main_menu_gui": ["385, 6", "no"], # кнопка в правом верхнем углу открывает меню

    "red_dot_clan": ["366, 87", "184, 13, 10"], # красная точка около клана
    "clan_1": ["61, 26", "185, 13, 10"], # по этой залупе чекаем что прогрузилось, это красная точка около текста Clan
    "clan_2": ["204, 205", "97, 85, 53"], # кнопка донат
    "clan_3": ["67, 178", "238, 187, 143"], # после доната выбор адены
    "clan_5": ["353, 29", "151, 153, 156"], # кнопка закрытия вкладки с выбором доната
    "clan_6": ["131, 156", "184, 13, 10"], # после всех донатов и закрытия красная точка около получения наград, для выхода можно юзать цбт npc_global_quit_button

    #maybe work? hz
    "red_dot_achiv": ["367, 5", "193, 23, 17"], # красная точка около ачивок
    "red_dot_achiv2": ["260, 27", "46, 32, 42"], # вторая крсаня точка уже в меню ачивок
    "achiv_claim_1": ["385, 51", "184, 13, 10"], # первая ачивка на клайм, можно дрюкать ее бесконечно пока не соберем все
    "achiv_claim_accept": ["174, 165", "208, 92, 9"], # подтверждение сбора ачивки

    "red_dot_mail": ["70, 27", "193, 23, 17"], # красная точка на почте в окне почты
    "red_dot_mail_menu": ["308, 170", "185, 13, 10"], # красная точка на почте в меню
    "claim_all_mail": ["346, 205", "207, 92, 13"], # собрать всю почту
    "clear_mail": ["198, 117", "30, 35, 42"], # когда писем нет
    "red_dot_mail_clear": ["70, 27", "193, 23, 17"],

    "red_dot_daily_rewards": ["308, 115", "193, 23, 17"], # красная точка на дейлике
    "red_dot_daily_2": ["395, 34", "182, 4, 5"], # красная точка когда уже открыл меню дейликов 1 вкладка
    "daily_rewards_claim_1": ["296, 119", "225, 153, 101"], # сбор дейлика верхний
    "daily_rewards_claim_2": ["300, 202", "216, 106, 12"],  # сбор дейлика нижний #todo
    "monetka_proverka": ["246, 114", "176, 119, 33"],
    "confirm_buy_daily": ["234, 151", "206, 89, 8"],

    "battle_pass_red_dot_gui": ["326, 170", "182, 4, 5"], # красная точка в меню что батл пасс надо собирать
    "battle_pass_sbor_1": ["286, 61", "193, 24, 17"], # сбор одной награды через Claim
    "battle_pass_sbor_2": ["386, 203", "185, 13, 10"], # сбор всех наград через клейм ревард большую кнопку
    "battle_pass_sbor_2_2": ["342, 203", "185, 13, 10"], # сбор всех наград через клейм ревард маленькую кнопку
    "battle_pass_empty": ["270, 24", "no"], # пустота сверху, чтоб не перекрывать цвет мышью

    "auction_menu": ["303, 90", "no"], # открытие аука через меню
    "auction_server_market_server": ["342, 16", "no"], # наш сервер
    "auction_server_market_global": ["296, 14", "no"],  # глобал аук
    "auction_nalog": ["29, 32", "133, 120, 122"], # белый текст налог в окне аука, проверяем что он открыт
    "auction_sold_red_dot": ["171, 26", "184, 14, 11"], # вкладка продано, там можно собрать алмазы
    "auction_sold_claim": ["338, 203", "76, 83, 97"], # сбор алмазов со вкладки продано
    "auction_sell_page": ["95, 30", "no"], # вклада продажа
    "auction_sell_select_all_active": ["252, 204", "158, 163, 170"], # во вкладке продажа выбор всего (перевыставление)
    "auction_sell_select_all_inactive": ["252, 204", "45, 49, 56"], # во вкладке продажа выбор всего (перевыставление) когда оно неактивно
    "auction_sell_reregister_active": ["351, 203", "70, 78, 92"], # перевыставление когда шмот выбран
    "auction_sell_reregister_confirm": ["206, 151", "206, 89, 8"], # подтверждение перевыставления за адену

    "trash_god_statue_trigger_1": ["88, 202", "185, 130, 43"], # если кликнули по неверному нпс то это статуя
    "trash_god_statue_trigger_2": ["282, 34", "149, 157, 176"],
    "trash_god_statue_trigger_3": ["22, 40", "255, 255, 255"],
    "trash_god_statue_trigger_4": ["230, 46", "103, 115, 128"],

    "alliance_menu_gui": ["380, 89", "no"],
    "alliance_donate_global_button": ["183, 199", "113, 99, 62"],
    "alliance_donate_1_button": ["58, 174", "215, 103, 11"],
    "alliance_donate_2_button": ["164, 184", "209, 95, 9"],
    "alliance_close_donate": ["357, 31", "36, 40, 47"],

    "error_disconnect_to_menu": ["192, 46", "234, 145, 94"], # куда кликнуть для входа на серв | +
    "error_disconnect_to_menu_trigger1": ["192, 46", "234, 145, 94"], # | +
    "error_disconnect_to_menu_trigger2": ["208, 127", "207, 145, 93"], # | +
    "error_disconnect_to_menu_trigger3": ["191, 106", "244, 239, 173"], # | +
    "error_disconnect_to_menu_trigger4": ["143, 83", "252, 248, 224"], # | +
    "error_disconnect_to_menu_with_err": ["190, 150", "217, 109, 12"], # куда кликнуть шоб закрыть табличку | +
    "error_disconnect_to_menu_with_err_trigger1": ["151, 95", "135, 136, 138"], # | +
    "error_disconnect_to_menu_with_err_trigger2": ["244, 106", "113, 115, 117"], # | +
    "error_disconnect_to_menu_with_err_trigger3": ["248, 98", "182, 183, 183"], # | +
    "error_disconnect_to_menu_with_err_trigger4": ["157, 105", "154, 155, 156"], # | +
    "enter_to_server": ["315, 199", "216, 105, 11"], # выбор персов, просто кнопка Enter
    "error_disconnect_full": ["188, 151", "223, 148, 95"], # куда кликнуть шоб закрыть окно после 10 мин афк
    "error_disconnect_full_trigger1": ["270, 103", "92, 94, 97"],
    "error_disconnect_full_trigger2": ["133, 100", "54, 56, 60"],
    "error_disconnect_full_trigger3": ["190, 101", "83, 85, 88"],
    "error_disconnect_full_trigger4": ["193, 103", "180, 180, 181"],
    "error_ethernet_1": ["202, 151", "224, 152, 101"], # (P:3102:500)
    "error_ethernet_1_trigger1": ["166, 95", "59, 62, 65"],
    "error_ethernet_1_trigger2": ["221, 95", "117, 118, 120"],
    "error_ethernet_1_trigger3": ["135, 103", "114, 116, 118"],
    "error_ethernet_1_trigger4": ["265, 107", "104, 106, 109"],
}

CBT_JP = {
    "party_dungeon_hard_1": ["266, 45", "no"],
    "party_dungeon_hard_2": ["266, 65", "no"],
    "party_dungeon_hard_3": ["266, 85", "no"],
    "party_dungeon_hard_4": ["266, 105", "no"],
    "party_dungeon_join": ["367, 205", "206, 89, 8"], # Заявка на вход
    "party_dungeon_join2": ["211, 146", "215, 104, 11"], # Заявка на вход после выбора сложности
    "party_dungeon_join3": ["213, 196", "207, 91, 8"], # после клика на портал
    "party_dungeon_button": ["135, 33", "90, 98, 109"], # вкладка после нажатия на dungeon_button_menu
    "dungeon_button_menu": ["322, 97", "no"], # подземелья в меню

    "party_settings": ["16, 117", "no"], # выше чем energo_mode_gui на 1
    "party_settings_me": ["262, 121", "15, 18, 22"],

    "autohunt_no_limit": ["378, 204", "148, 152, 158"], # первая стадия энерго кнопка с лимитом поиска цели "нет ограничений"

    "peace_on": ["373, 186", "159, 163, 170"],  # мирный режим включен
    "peace_off": ["368, 186", "42, 48, 56"],  # мирный режим выключен

    "schedule_menu": ["302, 118", "no"],
    "schedule_start": ["299, 199", "215, 102, 11"],
    "schedule_stop": ["303, 199", "113, 98, 61"],

    "magaz_monetka_reklama": ["214, 12", "24, 15, 7"],
    "magaz_circle_close": ["16, 183", "no"], # кругляш который закрывает баннер на веки
    "magaz_reklama_close": ["12, 185", "no"],
    "magaz_google_close": ["379, 16", "61, 63, 61"],
    "magaz_reklama_trigger": ["101, 196", "46, 46, 46"], # реклама в магазе, если ее видим то жмем по magaz_reklama_close
    "magaz_google_trigger": ["281, 122", "255, 255, 255"], # вторая реклама, закрывается magaz_google_close
    "magaz_gui_open": ["302, 12", "no"], # магазин донат
    "red_dot_magaz": ["173, 27", "193, 23, 17"], # красная точка в магазе внутри магаз интерфейса
    "3_vkladka": ["147, 35", "34, 45, 62"],
    "magaz_str_1": ["339, 53", "no"], #страница 1
    "magaz_str_2": ["356, 77", "no"], #страница 2
    "magaz_str_3": ["353, 97", "no"], #страница 3
    "magaz_str_4": ["352, 116", "no"], #страница 4
    "purc_all_magaz": ["338, 210", "216, 105, 12"], # оранж кнопка, открывает выбор шмоток на закуп
    "buy_all_magaz": ["248, 191", "207, 90, 8"], # когда шмотки выбраны жмем купить
    "close_buy_magaz": ["159, 192", "181, 184, 189"], # закрытие магаза когда вкладка открыта и выбраны шмотки
    "close_magaz": ["382, 11", "168, 169, 171"], # вроде правый верхнийц угол выход
    "confirm_orange_center": ["227, 151", "225, 125, 11"], # оранж кнопка конфирм
    
    "lvl_up_close": ["100, 29", "no"], # закрытие окна лвл апа
    "lvl_up_black": ["91, 174", "255, 255, 255"], # белая стрелка окна с лвлапом, юзаем как триггер 1
    "lvl_up_black_2": ["56, 176", "247, 248, 248"], # вторая хуйня слева от стрелки тоже белая, как триггер 2
    "white_cube_in_minimap": ["12, 62", "199, 199, 199"], # кубик который находится в миникарте, по нему можно понять открыт ли нпс лист, а в дальнейшем понять находимся ли мы в городе
    "monetka_gui": ["213, 11", "219, 174, 93"], # иконка монетки в гуи
    "diamond_gui": ["186, 9", "166, 172, 218"], # иконка алмаза в гуи
    "zalupka_gui": ["79, 26", "253, 253, 253"], # залупка тест

    "you_were_killed_energomode_1": ["166, 153", "78, 15, 27"], # плашка о смерти в режиме энергосбереж
    "you_were_killed_energomode_2": ["209, 153", "60, 13, 22"],
    "you_were_killed_energomode_3": ["233, 153", "155, 27, 48"],
    "check_death_penalty_1": ["165, 184", "90, 97, 109"], # кнопка респавна после смерти от игрока
    "check_death_penalty_2": ["212, 183", "182, 186, 191"],
    "check_death_penalty_3": ["188, 185", "140, 146, 155"],
    "respawn_village_1": ["165, 185", "72, 80, 93"], # вторая кнопка респавна после смерти от хай лвл моба
    "respawn_village_2": ["232, 187", "83, 90, 101"],
    "respawn_village_3": ["216, 186", "148, 152, 158"],

    "energo_mode_gui": ["13, 132", "no"], # кнопка для включения энерго режима, дальше нужно кликнуть в центр
    "auto_combat_mode_gui": ["323, 112", "no"], # кнопка для включения/выключения автоохоты
    "auto_combat_ON": ["184, 160", "68, 29, 4"], # исчезающая надпись оранжевая Huntng...
    "monetka_energomode_gui": ["15, 53", "216, 193, 146"], # монетка слева экрана
    "viewmode_change_btn": ["51, 211", "175, 176, 177"], # можно юзать вместо алмазика при проверках тп
    "pvp_energo_trigger": ["367, 145", "220, 220, 220"], # тригер пвп в энергорежиме, при виде него тпаем окно

    "energomode_center_gui": ["203, 103", "220, 220, 220"], # 2 белые полоски по центру энергомода по ним + по оффлайн фарму детектим находимся ли мы в энергомоде
    "offline_play_energomode_gui": ["316, 199", "182, 82, 9"], # белая буква кнопки оффлайн плея в энергорежиме

    "lvl_up_trigger": ["95, 172", "184, 13, 10"], # когда апнул лвл в энерго режиме вылазит окно, это тригер на его существование
    "need_lvl_up": ["10, 204", "184, 13, 10"], # это красная точка над лвлом, если есть то можем качнуть левл
    "lvl_up_activate1": ["17, 210", "no"], # если значение выше (need_lvl_up) тру то можно кликнуть сюда чтоб открыть меню лвл апа

    "npc_list_in_town": ["79, 52", "no"], # в городе кнопка которая открывает список нпс для авто-бега к ним
    "npc_list_1": ["17, 30", "no"], # 1
    "npc_list_2": ["17, 45", "200, 142, 105"], # 2 (тут возмозжен сундук)
    "npc_list_3": ["18, 61", "241, 220, 208"], # 3 (тут возмозжен сундук)
    "npc_list_4": ["17, 75", "250, 244, 239"], # 4 (тут возможен сундук)
    "npc_list_5": ["19, 90", "250, 241, 236"], # 5 (тут возможен сундук)
    "npc_list_6": ["17, 104", "no"], # 6

    "npc_global_quit_button": ["377, 10", "no"], # общая кнопка для всех нпс чтоб выйти из диалога
    "npc_stash_button_1": ["334, 204", "228, 229, 231"], # кнопка у складовщика Auto-Stash, по ней мы чекаем что добежали к складу
    "npc_stash_button_2": ["376, 204", "252, 245, 239"], # кнопка у складовщика Deposit All, по ней мы чекаем что складываем не пустоту
    "npc_shop_button_1": ["330, 206", "98, 104, 113"], # кнопка у торговца, по ней мы чекаем что дошли к нему
    "npc_shop_button_2": ["364, 205", "249, 235, 225"], # кнопка у торговца, по ней мы можем понять что покупаем не пустоту
    "npc_shop_button_3": ["253, 152", "207, 91, 8"], # кнопка у торговца, подтверждаем покупку
    "npc_shop_button_no_adena": ["243, 117", "214, 170, 100"], # после того как выбрали предметы и нажали на покупку может дать окно о том, что адены нет
    "npc_shop_button_no_adena_confirm": ["189, 150", "230, 157, 92"], # подтверждение о покупке адены
    "npc_buyer_button_1": ["297, 204", "241, 242, 243"], # кнопка у скупщика, такая же как и npc_stash_button_1, по ней чекаем что дошли
    "npc_buyer_button_2": ["364, 205", "249, 235, 225"], # кнопка у скупщика, такая же как npc_shop_button_2"
    "npc_buyer_button_3": ["253, 152", "207, 91, 8"], # кнопка у скупщика, такая же как npc_shop_button_3

    "respawn_select_all": ["115, 131", "123, 126, 130"],
    "delete_exp": ["33, 160", "36, 43, 50"],
    "delete_all_yes": ["223, 152", "248, 231, 219"],
    "respawn_exp": ["29, 32", "no"],
    "respawn_items": ["76, 36", "no"],
    "respawn_exit_gui_button": ["120, 28", "no"], # кнопка выхода из гуи
    "respawn_icon_in_gui": ["95, 175", "255, 255, 255"], # рандом залупа в окне выкупа предметов, по ней детектим открытое окно
    "monetka_respawn": ["103, 131", "182, 127, 38"], # в окне монетка которая меняет глобальную валюту выкупа, если не монетка можно кликать пока не будет монетки
    "krest_after_respawn": ["263, 13", "no"], # после респавна можно нажать на крест и выкупить свои шмотки
    "respawn_monetka_exp_1": ["37, 55", "255, 233, 168"],
    "respawn_monetka_exp_2": ["37, 76", "255, 233, 168"],
    "respawn_monetka_exp_3": ["37, 96", "244, 203, 126"],
    "respawn_monetka_exp_4": ["37, 118", "254, 230, 175"],
    "respawn_buy_gui_button": ["60, 156", "143, 147, 151"], # кнопка после выбора того что выкупать, подтверждаем
    "respawn_accept_buy_gui_button": ["222, 148", "244, 214, 188"], # кнопка подтверждения покупки выкупа

    "home_scroll_button_energomode": ["373, 177", "144, 120, 101"], # свиток телепорта в энергомоде
    "home_scroll_button_no_energomode": ["376, 197", "188, 168, 144"], # свиток телепорта в обычном интерфейсе

    "spot_teleport_call_button": ["76, 29", "no"], # кнопка вызова списка для телепорта на спот
    "spot_choice_1": ["72, 72", "no"], # кнопка выбора первого спота
    "spot_choice_2": ["72, 89", "no"], # кнопка выбора второго спота
    "spot_choice_3": ["72, 105", "no"], # кнопка выбора третьего спота
    "spot_choice_4": ["72, 121", "no"], # кнопка выбора четвертого спота

    "spot_accept_choice_1": ["94, 85", "255, 255, 255"], # кнопка телепорта на первый спот
    "spot_accept_choice_2": ["94, 101", "255, 255, 255"], # кнопка телепорта на второй спот
    "spot_accept_choice_3": ["94, 117", "255, 255, 255"], # кнопка телепорта на третий спот
    "spot_accept_choice_4": ["94, 139", "255, 255, 255"], # кнопка телепорта на четвертый спот

    # без колчана
    "hp_bank_in_energo": ["178, 197", "95, 95, 95"], # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    "soska_in_energo": ["205, 199", "35, 35, 35"], # когда сосок 0
    "pereves0": ["242, 194", "67, 67, 68"], # когда перевеса нет
    "pereves1": ["242, 194", "199, 40, 40"], # красный перевес 80%
    "pereves2": ["242, 194", "188, 90, 5"], # оражневый перевес 50%

    # с колчаном
    "q_quiver": ["147, 204", "1, 1, 2"], # колчан когда его нет
    "q_hp_bank_in_energo": ["189, 196", "47, 47, 47"], # банка хп когда их 0 либо она выключена, по ней детектим что надо в город на закуп
    "q_soska_in_energo": ["216, 199", "35, 35, 35"],  # когда сосок 0
    "q_pereves0": ["252, 194", "67, 67, 68"],  # когда перевеса нет
    "q_pereves1": ["252, 194", "199, 40, 40"],  # красный перевес 80%
    "q_pereves2": ["252, 194", "188, 90, 5"],  # оражневый перевес 50%

    "yes_button_vitality": ["215, 145", "215, 102, 11"],  # когда вылезла табличка шо уже лимит
    "cancel_button_vitality": ["158, 150", "117, 123, 133"],

    "main_menu_gui": ["385, 6", "no"], # кнопка в правом верхнем углу открывает меню
    "red_dot_clan": ["366, 60", "184, 13, 10"], # красная точка около клана
    "clan_1": ["61, 26", "185, 13, 10"], # по этой залупе чекаем что прогрузилось, это красная точка около текста Clan
    "clan_2": ["204, 205", "189, 184, 171"], # кнопка донат
    "clan_3": ["67, 178", "241, 200, 164"], # после доната выбор адены
    "clan_5": ["353, 29", "151, 153, 156"], # кнопка закрытия вкладки с выбором доната
    "clan_6": ["131, 156", "184, 13, 10"], # после всех донатов и закрытия красная точка около получения наград, для выхода можно юзать цбт npc_global_quit_button

    "red_dot_achiv": ["367, 5", "193, 23, 17"], # красная точка около ачивок
    "red_dot_achiv2": ["260, 27", "46, 32, 42"], # вторая крсаня точка уже в меню ачивок
    "achiv_claim_1": ["385, 51", "184, 13, 10"], # первая ачивка на клайм, можно дрюкать ее бесконечно пока не соберем все
    "achiv_claim_accept": ["178, 164", "235, 187, 152"], # подтверждение сбора ачивки

    "red_dot_mail": ["70, 27", "193, 23, 17"], # красная точка на почте в окне почты
    "red_dot_mail_menu": ["307, 147", "182, 4, 5"], # красная точка на почте в меню
    "claim_all_mail": ["346, 205", "222, 144, 89"], # собрать всю почту
    "clear_mail": ["198, 117", "30, 35, 42"], # когда писем нет
    "red_dot_mail_clear": ["70, 27", "193, 23, 17"],

    "red_dot_daily_rewards": ["327, 115", "193, 23, 17"], # красная точка на дейлике
    "red_dot_daily_2": ["395, 34", "182, 4, 5"], # красная точка когда уже открыл меню дейликов 1 вкладка
    "daily_rewards_claim_1": ["298, 119", "248, 231, 219"], # сбор дейлика верхний
    "daily_rewards_claim_2": ["300, 202", "216, 106, 12"],  # сбор дейлика нижний
    "monetka_proverka": ["246, 114", "176, 119, 33"],
    "confirm_buy_daily": ["234, 151", "206, 89, 8"],

    "battle_pass_red_dot_gui": ["326, 146", "184, 13, 10"], # красная точка в меню что батл пасс надо собирать
    "battle_pass_sbor_1": ["286, 61", "193, 24, 17"], # сбор одной награды через Claim
    "battle_pass_sbor_2": ["386, 203", "185, 13, 10"], # сбор всех наград через клейм ревард большую кнопку
    "battle_pass_sbor_2_2": ["342, 203", "185, 13, 10"], # сбор всех наград через клейм ревард маленькую кнопку
    "battle_pass_empty": ["270, 24", "no"], # пустота сверху, чтоб не перекрывать цвет мышью
    "auction_nalog": ["262, 31", "160, 163, 168"], # белый текст налог в окне аука, проверяем что он открыт
    "auction_menu": ["306, 90", "no"], # открытие аука через меню
    "auction_server_market_server": ["342, 16", "no"], # наш сервер
    "auction_server_market_global": ["296, 14", "no"],  # глобал аук
    "auction_sold_red_dot": ["171, 26", "184, 14, 11"], # вкладка продано, там можно собрать алмазы
    "auction_sold_claim": ["338, 203", "76, 83, 97"], # сбор алмазов со вкладки продано
    "auction_sell_page": ["95, 31", "no"], # вклада продажа
    "auction_sell_select_all_active": ["252, 204", "155, 160, 167"], # во вкладке продажа выбор всего (перевыставление)
    "auction_sell_select_all_inactive": ["252, 204", "45, 49, 56"], # во вкладке продажа выбор всего (перевыставление) когда оно неактивно
    "auction_sell_reregister_active": ["351, 203", "101, 108, 119"], # перевыставление когда шмот выбран
    "auction_sell_reregister_confirm": ["204, 151", "206, 89, 8"], # подтверждение перевыставления за адену

    "trash_god_statue_trigger_1": ["88, 202", "185, 130, 43"], # если кликнули по неверному нпс то это статуя
    "trash_god_statue_trigger_2": ["282, 34", "149, 157, 176"],
    "trash_god_statue_trigger_3": ["22, 40", "255, 255, 255"],
    "trash_god_statue_trigger_4": ["230, 46", "103, 115, 128"],

    "error_disconnect_to_menu": ["192, 46", "234, 145, 94"], # куда кликнуть для входа на серв
    "error_disconnect_to_menu_trigger1": ["192, 46", "234, 145, 94"],
    "error_disconnect_to_menu_trigger2": ["208, 127", "207, 145, 93"],
    "error_disconnect_to_menu_trigger3": ["191, 106", "244, 239, 173"],
    "error_disconnect_to_menu_trigger4": ["143, 83", "252, 248, 224"],
    "error_disconnect_to_menu_with_err": ["190, 150", "217, 109, 12"], # куда кликнуть шоб закрыть табличку дисконекта из-за инета
    "error_disconnect_to_menu_with_err_trigger1": ["150, 106", "102, 104, 106"],
    "error_disconnect_to_menu_with_err_trigger2": ["249, 106", "113, 115, 117"],
    "error_disconnect_to_menu_with_err_trigger3": ["194, 98", "129, 130, 132"],
    "error_disconnect_to_menu_with_err_trigger4": ["237, 98", "83, 85, 88"],
    "enter_to_server": ["315, 199", "216, 105, 11"], # выбор персов, просто кнопка Enter
    "error_disconnect_full": ["188, 151", "223, 148, 95"], # куда кликнуть шоб закрыть окно после 10 мин афк
    "error_disconnect_full_trigger1": ["270, 103", "92, 94, 97"],
    "error_disconnect_full_trigger2": ["133, 100", "54, 56, 60"],
    "error_disconnect_full_trigger3": ["190, 101", "83, 85, 88"],
    "error_disconnect_full_trigger4": ["193, 103", "180, 180, 181"],
    "error_ethernet_1": ["202, 151", "224, 152, 101"],  # (P:3102:500)
    "error_ethernet_1_trigger1": ["166, 95", "59, 62, 65"],
    "error_ethernet_1_trigger2": ["221, 95", "117, 118, 120"],
    "error_ethernet_1_trigger3": ["135, 103", "114, 116, 118"],
    "error_ethernet_1_trigger4": ["265, 107", "104, 106, 109"],
}

PARTY_DUNGEON_CONS = {
    "RU": {
        "need": ["190, 193, 197", "65, 68, 72"],
        "x": 174,
        "scroll": [45, 200],
        "portal": ["75-200, 25", "187, 212, 212"],
    },
    "JP": {
        "need": ["163, 166, 171"],
        "x": 166,
        "scroll": [45, 200],
        "portal": ["75-200, 25", "187, 212, 212"],
    },
}


BATTLE_PASS = {
    "red_dot_clr_podvkladka": ["140, 17, 13"], # красная точка на подвкладке
    "red_dot_clr_vkladka": ["184, 13, 10"], # красные точки по всей ширине основных вкладок сверху
    "y_vkladki": 25, # высота от левого верхного края окна игры, на этой высоте ищем от 1 координаты до 425 красные точки чтоб поняыть сколько вкладок бп актуально
    "x_podvkladki": 15 # ширина окна, по вертикали бегаем ищем подвкладки
}

DAILY = {
    "red_dot_clr": ["182, 4, 5"], # красная точка на вкладке
    "y_vkladki": 395,  # ширина окна

    "almaz_donate": ["156, 174, 198"], # внутри вкладки дейлика алмазик в кнопке
    "monetka_donate": ["247, 200, 112"], # внутри вкладки дейлика монетка в кнопке
    "donate_monetka_supermonetka": ["117, 79, 36"], # говно донатное не адена
    "monetka_proverka": ["246, 114", "176, 119, 33"],
    "confirm_buy_daily": ["234, 151", "206, 89, 8"],

    "claim_daily": ["207, 90, 8"],

    "start_button_1": 109,
    "end_button_1": 125,
    "start_button_2": 197,
    "end_button_2": 212
}

GLOBAL_STATES = [
    "null",
    "afk",
    "combat",
    "shopping",
    "stashing",
    "death",
    "claiming",
    "schedule",
    "pvp",
    "alchemy"
]

#todo мб добавить поддержку других? а надо ли?
SUPPORTED_REZ = [
    "400x225"
]
ALCH_BUTTONS = {}