CLICK_DELAY = 0.16 # ЗАДЕРЖКА МЕЖДУ КЛИКАМИ, СНИЖАТЬ ПРИ БОЛЬШОМ ПИНГЕ НЕ РЕКОМЕНДУЮ

# ЗАДЕРЖКИ

SLEEP_AFTER_UNBLOCK = 1.1 # сколько секунд спим после того как разблокировали окно? (если комп жестко лагает ставьте около 5-7)
DELAY_CHECK_ENERGO = 2.3 # задержка на проверку энерго режима
DELAY_WAIT_AUCTION = 5 # задержка ожидания после клика по "аукцион" пока он прогрузится (комп лагает ставь 10)
DELAY_WAIT_ADENA_SHOP_ADD = 6 # задержка ожидания обычной рекламы в донат шопе, окно лагает либо большой пинг - ставь 10 и более
DELAY_WAIT_ADENA_SHOP_GOOGLE = 6 # задержка ожидания привязки гугла в донат шопе, вылазит онли на японии
DELAY_CHECK_NPC_POSITIONS = 2 # задержка на проверку ВСЕХ СРАЗУ нпс в городе
DELAY_TELEPORT_TO_HOME = 3.4 # задержка для wait_teleport, лучше не меняйте
DELAY_AUTOHUNT_CHECK = 5 # задержка на проверку автоохоты
DELAY_PVP_ANSWER = 50 # таймаут на пвп ответ после которого попробуем вернуться на спот
PVP_CHECK_DELAY = 0.15 # раз в сколько секунд проверяем пвп триггер (2 меча)
DELAY_WAIT_EINHASAD = 5 # когда максимальное кол-во энергии и пробуем забрать еще даст ошибку, сколько ждем ее?
DELAY_WAIT_WAIT_TELEPORT = 2 # сколько спим перед началой проверки телепортнулись ли?

SLEEP_AFTER_RIP = 300 # секунды сна после смерти в пвп доджер профиле
MIN_PVP_DODGE_SLEEP = 2 # минуты сна после пвп доджа
MAX_PVP_DODGE_SLEEP = 4 # минуты сна после пвп доджа

# ПОРОГИ

THR_CHECK_NPC_POSITIONS = 5 # максимальный трешхолд на проверку нпс, мисскликает = понижайте либо повышайте.