# все задержки указаны в секундах, также в файле будут пороги цвета для некоторых проверок

# ЗАДЕРЖКИ

DELAY_CHECK_ENERGO = 2 # задержка на проверку энерго режима
DELAY_CHECK_NPC_POSITIONS = 1.7 # задержка на проверку ВСЕХ СРАЗУ нпс в городе
DELAY_TELEPORT_TO_HOME = 3.4 # задержка для wait_teleport, не меняйте
DELAY_AUTOHUNT_CHECK = 5 # задержка на проверку автоохоты
DELAY_PVP_ANSWER = 20 # таймаут на пвп ответ
PVP_CHECK_DELAY = 0.15

# ПОРОГИ

THR_CHECK_NPC_POSITIONS = 6 # максимальный трешхолд на проверку нпс, мисскликает = понижайте либо повышайте.